docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
#+TITLE: Endo's Formula Graph and Capability Protocols as Session Types
#+SUBTITLE: A Case Study in Object-Capability Protocol Verification
#+AUTHOR: The Prologos Project - from Zachary Larson
#+DATE: 2026-03-07

* Abstract

Endo is a runtime framework for supply-chain attack resistance in JavaScript,
built on Hardened JavaScript (SES) and the object-capability (OCap) security
model. At its core is a *formula graph* --- a persistent, directed graph of
typed formulas representing every capability, process, agent, and
communication channel managed by the Endo daemon. The formula graph
coordinates capability lifecycle, distributed garbage collection, process
isolation, inter-agent messaging, and capability transport across network
boundaries via CapTP (Capability Transport Protocol).

This document demonstrates that Endo's interacting protocols can be expressed
as composable session types in Prologos, using the protocols-as-types
composition mechanism described in =PROTOCOLS_AS_TYPES.org=. We pay special
attention to the asynchronous, eventual-send semantics pervasive in Endo,
using Prologos's =!!= (async send) and =??= (async recv) operators to
capture the non-blocking, promise-pipelined nature of capability interactions.
Capabilities track authority through every protocol transition via Prologos's
linear types and capability type annotations.

The analysis identifies several protocol-level properties --- including
mutex re-entrancy hazards, GC ordering constraints, and the implicit
state machine governing formula lifecycle --- that session types make
explicit and statically verifiable.


* 1. Endo Architecture Overview

** 1.1 What Is Endo?

Endo is part of the Agoric ecosystem for hardened JavaScript. It provides:

- *Hardened JavaScript (SES)*: A locked-down JavaScript environment where all
  primordials are frozen, ambient authority (filesystem, network, =process.env=)
  is removed, and code executes in isolated =Compartment= scopes with
  explicitly granted endowments.

- *Object-Capability Security*: Authority is represented by object references.
  Holding a reference /is/ having the capability. References cannot be forged,
  guessed, or extracted from strings. To gain a capability, it must be
  /granted/ by someone who already holds it.

- *Persistent Daemon*: The Endo daemon manages a formula graph on disk,
  persisting all capabilities, agents, workers, and naming relationships
  across restarts. Users interact via CLI commands (=endo eval=, =endo send=,
  =endo invite=) that connect to the daemon over Unix domain sockets.

- *Distributed Capabilities*: CapTP enables capability references to cross
  process and network boundaries, maintaining the OCap discipline over the
  wire via marshalled slot references and promise pipelining.

#+begin_example
 User                   CLI                   Daemon                  Worker(s)
  |                      |                      |                       |
  |--- endo eval ------->|                      |                       |
  |                      |--- Unix socket ------>|                       |
  |                      |    CapTP handshake    |                       |
  |                      |<-- bootstrap cap -----|                       |
  |                      |                      |--- fork process ----->|
  |                      |                      |    CapTP over pipes    |
  |                      |                      |--- CTP_CALL -------->|
  |                      |                      |<-- CTP_RETURN -------|
  |                      |<-- result ------------|                       |
  |<-- output ------------|                      |                       |
#+end_example

** 1.2 Key Participants

| Role     | Description                                             | Endo Name     |
|----------+---------------------------------------------------------+---------------|
| Daemon   | Central process managing the formula graph, agents,     | =EndoDaemon=  |
|          | workers, networking, and persistence                    |               |
| Host     | A fully-powered agent that can create workers, guests,  | =EndoHost=    |
|          | evaluate code, manage invitations, and grant authority   |               |
| Guest    | A reduced-authority agent that must request evaluation   | =EndoGuest=   |
|          | and capability grants through its host                  |               |
| Worker   | An isolated Compartment for code execution; communicates | =EndoWorker=  |
|          | with the daemon via CapTP over stdin/stdout pipes        |               |
| Client   | A CLI or programmatic client connecting via Unix socket  | =EndoClient=  |
| Peer     | A remote Endo daemon connected via TCP/libp2p           | =EndoPeer=    |

** 1.3 Key Data Types

#+begin_src prologos
;; --- Endo Core Identifier Types ---

;; FormulaNumber and NodeNumber are 256-bit hex strings (64 chars)
type FormulaNumber := String    ;; identifies a formula within a node
type NodeNumber := String       ;; identifies a node (Ed25519 pubkey)

;; FormulaIdentifier = "FormulaNumber:NodeNumber"
type FormulaIdentifier := String

;; Pet names are local, per-agent capability aliases
type PetName := String

;; Special names are built-in references (SELF, HOST, AGENT, ENDO, etc.)
type SpecialName := :SELF | :HOST | :AGENT | :ENDO | :KEYPAIR
                  | :MAIN | :NETS | :PINS | :INFO | :NONE | :MAIL

;; CapTP slot references
type SlotId
  := ExportSlot Nat        ;; o+N — locally exported object
   | ImportSlot Nat         ;; o-N — imported remote object
   | ExportPromise Nat      ;; p+N — locally exported promise
   | ImportPromise Nat      ;; p-N — imported remote promise
   | Question Nat           ;; q-N — pending call awaiting answer

;; Power attenuation levels
type PowerLevel := :NONE | :SELF | :AGENT | :ENDO | :HOST
#+end_src

