docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.tex
% Created 2026-03-06 Fri 20:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{The Prologos Project - from Zachary Larson}
\date{2026-03-07}
\title{Endo's Formula Graph and Capability Protocols as Session Types\\\medskip
\large A Case Study in Object-Capability Protocol Verification}
\hypersetup{
 pdfauthor={The Prologos Project - from Zachary Larson},
 pdftitle={Endo's Formula Graph and Capability Protocols as Session Types},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 30.2 (Org mode 9.7.39)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Abstract}
\label{sec:org525c52b}

Endo is a runtime framework for supply-chain attack resistance in JavaScript,
built on Hardened JavaScript (SES) and the object-capability (OCap) security
model. At its core is a \textbf{formula graph} --- a persistent, directed graph of
typed formulas representing every capability, process, agent, and
communication channel managed by the Endo daemon. The formula graph
coordinates capability lifecycle, distributed garbage collection, process
isolation, inter-agent messaging, and capability transport across network
boundaries via CapTP (Capability Transport Protocol).

This document demonstrates that Endo's interacting protocols can be expressed
as composable session types in Prologos, using the protocols-as-types
composition mechanism described in \texttt{PROTOCOLS\_AS\_TYPES.org}. We pay special
attention to the asynchronous, eventual-send semantics pervasive in Endo,
using Prologos's \texttt{!!} (async send) and \texttt{??} (async recv) operators to
capture the non-blocking, promise-pipelined nature of capability interactions.
Capabilities track authority through every protocol transition via Prologos's
linear types and capability type annotations.

The analysis identifies several protocol-level properties --- including
mutex re-entrancy hazards, GC ordering constraints, and the implicit
state machine governing formula lifecycle --- that session types make
explicit and statically verifiable.
\section{1. Endo Architecture Overview}
\label{sec:orga5aa529}

\subsection{1.1 What Is Endo?}
\label{sec:org701fe6e}

Endo is part of the Agoric ecosystem for hardened JavaScript. It provides:

\begin{itemize}
\item \textbf{Hardened JavaScript (SES)}: A locked-down JavaScript environment where all
primordials are frozen, ambient authority (filesystem, network, \texttt{process.env})
is removed, and code executes in isolated \texttt{Compartment} scopes with
explicitly granted endowments.

\item \textbf{Object-Capability Security}: Authority is represented by object references.
Holding a reference \emph{is} having the capability. References cannot be forged,
guessed, or extracted from strings. To gain a capability, it must be
\emph{granted} by someone who already holds it.

\item \textbf{Persistent Daemon}: The Endo daemon manages a formula graph on disk,
persisting all capabilities, agents, workers, and naming relationships
across restarts. Users interact via CLI commands (\texttt{endo eval}, \texttt{endo send},
\texttt{endo invite}) that connect to the daemon over Unix domain sockets.

\item \textbf{Distributed Capabilities}: CapTP enables capability references to cross
process and network boundaries, maintaining the OCap discipline over the
wire via marshalled slot references and promise pipelining.
\end{itemize}

\begin{verbatim}
User                   CLI                   Daemon                  Worker(s)
 |                      |                      |                       |
 |--- endo eval ------->|                      |                       |
 |                      |--- Unix socket ------>|                       |
 |                      |    CapTP handshake    |                       |
 |                      |<-- bootstrap cap -----|                       |
 |                      |                      |--- fork process ----->|
 |                      |                      |    CapTP over pipes    |
 |                      |                      |--- CTP_CALL -------->|
 |                      |                      |<-- CTP_RETURN -------|
 |                      |<-- result ------------|                       |
 |<-- output ------------|                      |                       |
\end{verbatim}
\subsection{1.2 Key Participants}
\label{sec:orga2de8d2}

\begin{center}
\begin{tabular}{lll}
Role & Description & Endo Name\\
\hline
Daemon & Central process managing the formula graph, agents, & \texttt{EndoDaemon}\\
 & workers, networking, and persistence & \\
Host & A fully-powered agent that can create workers, guests, & \texttt{EndoHost}\\
 & evaluate code, manage invitations, and grant authority & \\
Guest & A reduced-authority agent that must request evaluation & \texttt{EndoGuest}\\
 & and capability grants through its host & \\
Worker & An isolated Compartment for code execution; communicates & \texttt{EndoWorker}\\
 & with the daemon via CapTP over stdin/stdout pipes & \\
Client & A CLI or programmatic client connecting via Unix socket & \texttt{EndoClient}\\
Peer & A remote Endo daemon connected via TCP/libp2p & \texttt{EndoPeer}\\
\end{tabular}
\end{center}
\subsection{1.3 Key Data Types}
\label{sec:org7b28e91}

\begin{verbatim}
;; --- Endo Core Identifier Types ---

;; FormulaNumber and NodeNumber are 256-bit hex strings (64 chars)
type FormulaNumber := String    ;; identifies a formula within a node
type NodeNumber := String       ;; identifies a node (Ed25519 pubkey)

;; FormulaIdentifier = "FormulaNumber:NodeNumber"
type FormulaIdentifier := String

;; Pet names are local, per-agent capability aliases
type PetName := String

;; Special names are built-in references (SELF, HOST, AGENT, ENDO, etc.)
type SpecialName := :SELF | :HOST | :AGENT | :ENDO | :KEYPAIR
                  | :MAIN | :NETS | :PINS | :INFO | :NONE | :MAIL

;; CapTP slot references
type SlotId
  := ExportSlot Nat        ;; o+N — locally exported object
   | ImportSlot Nat         ;; o-N — imported remote object
   | ExportPromise Nat      ;; p+N — locally exported promise
   | ImportPromise Nat      ;; p-N — imported remote promise
   | Question Nat           ;; q-N — pending call awaiting answer

;; Power attenuation levels
type PowerLevel := :NONE | :SELF | :AGENT | :ENDO | :HOST
\end{verbatim}
