docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
** 1.4 Formula Types

The formula graph contains 26+ typed formulas. Each formula is a JSON record
with a =type= discriminant and formula-specific fields:

#+begin_src prologos
;; --- Formula Type Hierarchy ---
;; Formulas are the nodes of the formula graph.
;; Each formula describes HOW to construct/reconstruct a capability.

type Formula
  ;; --- Agents & Identity ---
  := EndoFormula                                ;; root of the system
   | HostFormula PetStoreId MailboxId WorkerId PrivateStoreId
   | GuestFormula HostId PetStoreId MailboxId
   | DirectoryFormula PetStoreId
   ;; --- Code Execution ---
   | EvalFormula WorkerId Source [List PetName] [List PetName] PowerLevel
   | WorkerFormula                              ;; sandboxed Compartment
   | ReadableBlobFormula Content                ;; stored binary data
   | BundleFormula ReadableId                   ;; importable module bundle
   ;; --- Communication ---
   | HandleFormula FormulaIdentifier            ;; local or remote reference
   | PeerFormula NetworkId NodeNumber           ;; remote node connection
   | LoopbackFormula                            ;; self-connection
   ;; --- Persistence ---
   | PetStoreFormula                            ;; name -> formula mapping
   | PetInspectorFormula PetStoreId             ;; read-only view of a store
   | MailboxFormula PetStoreId                  ;; message storage
   ;; --- Promises ---
   | PromiseFormula StoreId                     ;; deferred value
   | ResolverFormula StoreId                    ;; resolution authority
   ;; --- Networking ---
   | InvitationFormula NetworkId [List Byte]    ;; capability invite token
   | ChannelFormula                             ;; bidirectional pipe
   ;; --- Authority ---
   | LeastAuthorityFormula                      ;; the NONE capability
   | LookupFormula HubId PetName               ;; deferred name resolution
   ;; --- Messages ---
   | RequestFormula SenderNum RecipientNum Description [List PetName]
   | PackageFormula SenderNum RecipientNum [List String] [Map String FormulaIdentifier]
#+end_src


* 2. The Formula Graph

The formula graph is the central data structure of the Endo daemon. It is a
persistent directed graph where nodes are typed formulas and edges represent
dependencies and naming relationships.

** 2.1 Graph Structure

#+begin_example
                  ┌─────────────┐
                  │  EndoFormula │ (permanent root)
                  │  type: endo │
                  └──────┬──────┘
                         │ depends
              ┌──────────┼──────────┐
              v          v          v
        ┌──────────┐ ┌───────┐ ┌───────┐
        │ HostForm.│ │PinForm│ │NetForm│
        │ type:host│ │ :pins │ │ :nets │
        └──┬───────┘ └───────┘ └───────┘
           │ depends
     ┌─────┼─────┬─────────┐
     v     v     v         v
  ┌──────┐┌───┐┌──────┐┌───────┐
  │PetSt.││Wkr││Mailbx││PvtSt. │
  │:store││:wk││:mail ││:pvtSt.│
  └──┬───┘└───┘└──────┘└───────┘
     │ dynamic (pet names)
     v
  ┌──────────────────────┐
  │  user-defined caps   │
  │  (eval, handle, ...) │
  └──────────────────────┘
#+end_example

There are two kinds of edges:

1. *Static formula dependencies*: Derived from the formula definition. A
   =HostFormula= depends on its =petStore=, =mailbox=, =worker=, and
   =privateStore=. These are immutable once the formula is created.

2. *Dynamic pet-store edges*: When a user writes a pet name (=endo store
   my-app=), a dynamic edge is created from the pet store formula to the
   target formula. These edges can be added, renamed, and removed at any
   time.

** 2.2 Union-Find Groups

Certain formulas share identity --- they are semantically "the same thing"
and must be garbage-collected atomically:

- *Handle + Agent*: A =HandleFormula= paired with its =HostFormula= or
  =GuestFormula= form a single capability identity.
- *Promise + Resolver*: A =PromiseFormula= and its =ResolverFormula= share a
  =store= identifier. The promise observation and the resolution authority
  are two facets of one identity.

The formula graph uses a union-find data structure with path compression and
union-by-size to manage these identity groups. Garbage collection operates at
the group level --- if any formula in a group is reachable, the entire group
is retained.

** 2.3 Persistence Invariant

A critical invariant: *disk before graph*. The formula JSON is persisted to
the filesystem /before/ entering the in-memory maps. This ensures that a
daemon crash at any point during formula creation leaves the system in a
recoverable state --- the formula either exists fully on disk (and will be
reconstructed on restart) or does not exist at all.

** 2.4 Single Async Mutex

All mutations to the formula graph are serialized through a single async
mutex (=formulaGraphJobs=). Operations are enqueued and executed
sequentially. The mutex includes re-entrancy detection --- if a formula
operation attempts to re-enter the mutex from within its own evaluation,
this is detected and reported.

This is a crucial design point. The single mutex ensures that the graph is
always in a consistent state between operations, but it also means that all
formula operations are sequentialized. This is where session types can
contribute: by making the sequential protocol /explicit/, we can verify that
operations are correctly ordered without relying solely on runtime mutex
enforcement.


* 3. Session Type Notation

Before diving into the protocol models, we summarize the Prologos session
type operators used throughout this document:

| Operator  | Meaning                              | Example              |
|-----------+--------------------------------------+----------------------|
| =!=       | Synchronous send                     | =! String=           |
| =?=       | Synchronous receive                  | =? Int=              |
| =!!=      | Asynchronous (buffered) send         | =!! EvalRequest=     |
| =??=      | Asynchronous (buffered) receive      | =?? Result=          |
| =!:=      | Dependent send (binds in cont.)      | =!: n Nat=           |
| =?:=      | Dependent receive (binds in cont.)   | =?: n Nat=           |
| =+>=      | Internal choice (select a branch)    | =+> \vert :ok -> ...=  |
| =&>=      | External choice (offer branches)     | =&> \vert :ok -> ...=  |
| =rec=     | Recursive session                    | =rec X. ... X=       |
| =end=     | Session termination                  |                      |
| =[Cap C]= | Capability annotation                | =[Cap FileWrite]=    |

The =!!= / =??= operators are essential for modelling Endo. In Endo, nearly
all inter-object communication is /eventual/ --- method calls go through
=E()= (the eventual-send proxy), which returns a promise rather than
blocking. This maps directly to =!!/??= in session types: the sender fires
and continues immediately; the receiver will observe the value eventually
but not necessarily synchronously.

*Naming convention*: Each named session type in this document corresponds to
one identifiable protocol or sub-protocol in the Endo codebase. Session
names are capitalized and use hyphens (=CapTP-Call=, =Formula-Lifecycle=).


* 4. CapTP: Capability Transport Protocol

CapTP is Endo's wire protocol for distributed capability communication. It
implements the OCapN (Object Capability Network) standard. Every CLI-to-daemon,
daemon-to-worker, and daemon-to-daemon interaction flows through CapTP.

