docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.tex
\subsection{1.4 Formula Types}
\label{sec:org997fb0e}

The formula graph contains 26+ typed formulas. Each formula is a JSON record
with a \texttt{type} discriminant and formula-specific fields:

\begin{verbatim}
;; --- Formula Type Hierarchy ---
;; Formulas are the nodes of the formula graph.
;; Each formula describes HOW to construct/reconstruct a capability.

type Formula
  ;; --- Agents & Identity ---
  := EndoFormula                                ;; root of the system
   | HostFormula PetStoreId MailboxId WorkerId PrivateStoreId
   | GuestFormula HostId PetStoreId MailboxId
   | DirectoryFormula PetStoreId
   ;; --- Code Execution ---
   | EvalFormula WorkerId Source [List PetName] [List PetName] PowerLevel
   | WorkerFormula                              ;; sandboxed Compartment
   | ReadableBlobFormula Content                ;; stored binary data
   | BundleFormula ReadableId                   ;; importable module bundle
   ;; --- Communication ---
   | HandleFormula FormulaIdentifier            ;; local or remote reference
   | PeerFormula NetworkId NodeNumber           ;; remote node connection
   | LoopbackFormula                            ;; self-connection
   ;; --- Persistence ---
   | PetStoreFormula                            ;; name -> formula mapping
   | PetInspectorFormula PetStoreId             ;; read-only view of a store
   | MailboxFormula PetStoreId                  ;; message storage
   ;; --- Promises ---
   | PromiseFormula StoreId                     ;; deferred value
   | ResolverFormula StoreId                    ;; resolution authority
   ;; --- Networking ---
   | InvitationFormula NetworkId [List Byte]    ;; capability invite token
   | ChannelFormula                             ;; bidirectional pipe
   ;; --- Authority ---
   | LeastAuthorityFormula                      ;; the NONE capability
   | LookupFormula HubId PetName               ;; deferred name resolution
   ;; --- Messages ---
   | RequestFormula SenderNum RecipientNum Description [List PetName]
   | PackageFormula SenderNum RecipientNum [List String] [Map String FormulaIdentifier]
\end{verbatim}
\section{2. The Formula Graph}
\label{sec:orgd41f91f}

The formula graph is the central data structure of the Endo daemon. It is a
persistent directed graph where nodes are typed formulas and edges represent
dependencies and naming relationships.
\subsection{2.1 Graph Structure}
\label{sec:org2e88670}

\begin{verbatim}
                ┌─────────────┐
                │  EndoFormula │ (permanent root)
                │  type: endo │
                └──────┬──────┘
                       │ depends
            ┌──────────┼──────────┐
            v          v          v
      ┌──────────┐ ┌───────┐ ┌───────┐
      │ HostForm.│ │PinForm│ │NetForm│
      │ type:host│ │ :pins │ │ :nets │
      └──┬───────┘ └───────┘ └───────┘
         │ depends
   ┌─────┼─────┬─────────┐
   v     v     v         v
┌──────┐┌───┐┌──────┐┌───────┐
│PetSt.││Wkr││Mailbx││PvtSt. │
│:store││:wk││:mail ││:pvtSt.│
└──┬───┘└───┘└──────┘└───────┘
   │ dynamic (pet names)
   v
┌──────────────────────┐
│  user-defined caps   │
│  (eval, handle, ...) │
└──────────────────────┘
\end{verbatim}

There are two kinds of edges:

\begin{enumerate}
\item \textbf{Static formula dependencies}: Derived from the formula definition. A
\texttt{HostFormula} depends on its \texttt{petStore}, \texttt{mailbox}, \texttt{worker}, and
\texttt{privateStore}. These are immutable once the formula is created.

\item \textbf{Dynamic pet-store edges}: When a user writes a pet name (\texttt{endo store
   my-app}), a dynamic edge is created from the pet store formula to the
target formula. These edges can be added, renamed, and removed at any
time.
\end{enumerate}
\subsection{2.2 Union-Find Groups}
\label{sec:orgfeb69f0}

Certain formulas share identity --- they are semantically "the same thing"
and must be garbage-collected atomically:

\begin{itemize}
\item \textbf{Handle + Agent}: A \texttt{HandleFormula} paired with its \texttt{HostFormula} or
\texttt{GuestFormula} form a single capability identity.
\item \textbf{Promise + Resolver}: A \texttt{PromiseFormula} and its \texttt{ResolverFormula} share a
\texttt{store} identifier. The promise observation and the resolution authority
are two facets of one identity.
\end{itemize}

The formula graph uses a union-find data structure with path compression and
union-by-size to manage these identity groups. Garbage collection operates at
the group level --- if any formula in a group is reachable, the entire group
is retained.
\subsection{2.3 Persistence Invariant}
\label{sec:org4038f40}

A critical invariant: \textbf{disk before graph}. The formula JSON is persisted to
the filesystem \emph{before} entering the in-memory maps. This ensures that a
daemon crash at any point during formula creation leaves the system in a
recoverable state --- the formula either exists fully on disk (and will be
reconstructed on restart) or does not exist at all.
\subsection{2.4 Single Async Mutex}
\label{sec:orgd3cecdd}

All mutations to the formula graph are serialized through a single async
mutex (\texttt{formulaGraphJobs}). Operations are enqueued and executed
sequentially. The mutex includes re-entrancy detection --- if a formula
operation attempts to re-enter the mutex from within its own evaluation,
this is detected and reported.

This is a crucial design point. The single mutex ensures that the graph is
always in a consistent state between operations, but it also means that all
formula operations are sequentialized. This is where session types can
contribute: by making the sequential protocol \emph{explicit}, we can verify that
operations are correctly ordered without relying solely on runtime mutex
enforcement.
\section{3. Session Type Notation}
\label{sec:orge478b7b}

Before diving into the protocol models, we summarize the Prologos session
type operators used throughout this document:

\begin{center}
\begin{tabular}{lll}
Operator & Meaning & Example\\
\hline
\texttt{!} & Synchronous send & \texttt{! String}\\
\texttt{?} & Synchronous receive & \texttt{? Int}\\
\texttt{!!} & Asynchronous (buffered) send & \texttt{!! EvalRequest}\\
\texttt{??} & Asynchronous (buffered) receive & \texttt{?? Result}\\
\texttt{!:} & Dependent send (binds in cont.) & \texttt{!: n Nat}\\
\texttt{?:} & Dependent receive (binds in cont.) & \texttt{?: n Nat}\\
\texttt{+>} & Internal choice (select a branch) & \texttt{+> \textbackslash{}vert :ok -> ...}\\
\texttt{\&>} & External choice (offer branches) & \texttt{\&> \textbackslash{}vert :ok -> ...}\\
\texttt{rec} & Recursive session & \texttt{rec X. ... X}\\
\texttt{end} & Session termination & \\
\texttt{[Cap C]} & Capability annotation & \texttt{[Cap FileWrite]}\\
\end{tabular}
\end{center}

The \texttt{!!} / \texttt{??} operators are essential for modelling Endo. In Endo, nearly
all inter-object communication is \emph{eventual} --- method calls go through
\texttt{E()} (the eventual-send proxy), which returns a promise rather than
blocking. This maps directly to \texttt{!!/??} in session types: the sender fires
and continues immediately; the receiver will observe the value eventually
but not necessarily synchronously.

\textbf{Naming convention}: Each named session type in this document corresponds to
one identifiable protocol or sub-protocol in the Endo codebase. Session
names are capitalized and use hyphens (\texttt{CapTP-Call}, \texttt{Formula-Lifecycle}).
\section{4. CapTP: Capability Transport Protocol}
\label{sec:orgd9c0525}

CapTP is Endo's wire protocol for distributed capability communication. It
implements the OCapN (Object Capability Network) standard. Every CLI-to-daemon,
daemon-to-worker, and daemon-to-daemon interaction flows through CapTP.
