docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
** 4.1 Transport Layers

CapTP is transport-agnostic. It requires only a message-passing channel:

#+begin_example
Application:  E(remoteObj).method(args)    (eventual send)
     |
     v
CapTP:        CTP_CALL { questionID, target, method, args }
     |
     v
Marshal:      toCapData(args) -> { body: JSON, slots: [SlotId] }
     |
     v
Framing:      Netstring encoding (length-prefixed message boundaries)
     |
     v
Transport:    Unix socket / stdin-stdout pipes / TCP / libp2p
#+end_example

** 4.2 The CapTP Message Protocol

#+begin_src prologos
;; --- CapTP Messages ---

type CapTP-Message
  := CTP-Bootstrap QuestionId
   | CTP-Call QuestionId SlotId MethodName [List CapData]
   | CTP-Return AnswerId CapTP-Result
   | CTP-Resolve PromiseSlotId CapTP-Resolution
   | CTP-Drop SlotId Nat           ;; slot + decrement count
   | CTP-Disconnect DisconnectReason
   | CTP-TrapIterate QuestionId SerializedData

type CapTP-Result
  := CallFulfilled CapData
   | CallRejected CapData

type CapTP-Resolution
  := PromiseFulfilled CapData
   | PromiseRejected CapData

;; Serialized capability data: body + slots
type CapData
  :body  String                     ;; JSON with slot markers
  :slots [List SlotId]              ;; referenced capabilities
#+end_src

** 4.3 Session Types for CapTP

The CapTP protocol has two distinct phases: a bootstrap handshake, followed
by a multiplexed steady-state protocol. We model these separately.

#+begin_src prologos
;; --- Bootstrap Handshake ---
;; The initiating side requests the remote's root capability.

session CapTP-Bootstrap
  !! CTP-Bootstrap         ;; send bootstrap request (async — fire and continue)
  ?? CapTP-Result           ;; receive the bootstrap capability (eventually)
  CapTP-Steady              ;; transition to steady-state protocol
#+end_src

The bootstrap is inherently asynchronous: the client sends a bootstrap
request and continues setting up its local state; the daemon processes the
request and returns the bootstrap capability when ready. This is why we use
=!!/??= rather than =!/?.=

#+begin_src prologos
;; --- Steady-State CapTP ---
;; After bootstrap, both sides can send any CapTP message.
;; The protocol is symmetric — either side can initiate calls.
;; Multiple concurrent calls are tracked by questionID.

session CapTP-Steady
  rec Steady
    +>                                   ;; internal choice: what to send
      | :call ->
          !! CTP-Call                    ;; send method call (async)
          ?? CapTP-Result                ;; receive result (eventually)
          Steady
      | :resolve ->
          !! CTP-Resolve                 ;; notify promise settlement
          Steady
      | :drop ->
          !! CTP-Drop                    ;; GC: decrement reference count
          Steady
      | :disconnect ->
          !! CTP-Disconnect              ;; terminate connection
          end
      | :receive ->                      ;; also offering to the remote
          &>
            | :remote-call ->
                ?? CTP-Call              ;; receive method call
                !! CapTP-Result          ;; send result
                Steady
            | :remote-resolve ->
                ?? CTP-Resolve           ;; receive promise resolution
                Steady
            | :remote-drop ->
                ?? CTP-Drop              ;; receive GC signal
                Steady
            | :remote-disconnect ->
                ?? CTP-Disconnect        ;; receive disconnection
                end
#+end_src

*Key observation*: CapTP is a /multiplexed/ protocol. Multiple concurrent
calls share a single connection, each tracked by =questionID=. A more precise
model would use /indexed session types/ where each =questionID= has its own
sub-session:

#+begin_src prologos
;; --- Indexed CapTP Call ---
;; Each questionID corresponds to an independent call sub-session.

session CapTP-Call {qid : QuestionId}
  !! [CTP-Call qid]              ;; send call with this question ID
  ?? [CapTP-Result qid]          ;; receive result for this question ID
  end                             ;; sub-session complete
#+end_src

The multiplexing structure is where Endo's /promise pipelining/ lives:
=E(E(x).foo()).bar()= sends /two/ =CTP_CALL= messages immediately, without
waiting for the first to resolve. The second call targets the /promise slot/
(=p-N=) of the first call's result. This is type-safe because the session
type for the pipelined call accepts a promise slot as its target.

** 4.4 Slot Duality

CapTP's slot scheme has a beautiful duality structure:

#+begin_example
   Side A                    Side B
   ──────                    ──────
   o+0 (my export)    ↔     o-0 (their import)
   o-1 (my import)    ↔     o+1 (their export)
   p+2 (my promise)   ↔     p-2 (their promise)
   q-3 (my question)  ↔     answer 3 (their answer)
#+end_example

This is exactly /session type duality/. Every export on one side is an import
on the other. The =+/−= prefixes are the syntactic manifestation of the
dual session type. In Prologos terms, if Side A has session type =S=, then
Side B has session type =dual(S)= --- and the CapTP slot scheme is the
runtime witness of this duality.

** 4.5 Protocol-Level Observations

*Promise pipelining and eventual-send semantics*: Every method call in Endo
goes through =E()=, which is semantically an asynchronous message send. The
caller gets back a /handled promise/ that supports further eventual sends
without waiting for the first to resolve. This is why =!!/??= is the correct
model: =E(target).method(args)= is an =!! CTP-Call= that returns a promise
slot, and any subsequent =E(result).next()= is another =!! CTP-Call=
targeting that promise slot.

*No synchronous calls across boundaries*: CapTP has a =CTP_TRAP_ITERATE=
message type for synchronous trap calls, but this is an escape hatch used
only for specific debugging scenarios, not the normal protocol. The standard
protocol is fully asynchronous. This aligns with the OCap principle that
capabilities should not block on remote operations.


* 5. Formula Lifecycle Protocol

Every formula in the graph goes through a well-defined lifecycle. This
lifecycle is currently implicit in the =daemon.js= code but can be made
explicit as a session type.

