docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
** 5.1 The Lifecycle State Machine

#+begin_example
                        ┌─────────────┐
                        │ Preformulate │
                        │  (allocate   │
                        │  formula ID) │
                        └──────┬──────┘
                               │ persist to disk
                               v
                        ┌─────────────┐
                        │  Formulate   │
                        │  (register   │
                        │  in graph)   │
                        └──────┬──────┘
                               │ create controller (sync!)
                               v
                        ┌─────────────┐
                        │  Controlled  │
                        │  (controller │
                        │  exists)     │
                        └──────┬──────┘
                               │ evaluate (async)
                               v
                        ┌─────────────┐
                   ┌────│   Active     │────┐
                   │    │ (value ready)│    │
                   │    └──────┬──────┘    │
                   │           │            │
              GC collect    cancel      crash
                   │           │            │
                   v           v            v
                ┌──────────────────────────┐
                │        Cancelled         │
                │  (dependents notified,   │
                │   resources cleaned up)  │
                └──────────┬───────────────┘
                           │ dispose
                           v
                ┌──────────────────────────┐
                │        Disposed          │
                │  (cleanup hooks run,     │
                │   removed from graph)    │
                └──────────────────────────┘
#+end_example

** 5.2 Session Type for Formula Lifecycle

#+begin_src prologos
;; --- Formula Lifecycle ---
;; Models the daemon's perspective on a single formula's life.

session Formula-Lifecycle
  ;; Phase 1: Allocate a unique FormulaIdentifier
  ! FormulaIdentifier                  ;; assign formula number
  ;; Phase 2: Persist to disk (disk-before-graph invariant)
  ! Formula                            ;; write formula JSON to filesystem
  ;; Phase 3: Register in graph and create controller (SYNCHRONOUS)
  ! Controller                         ;; controller created before any await
  ;; Phase 4: Evaluate asynchronously
  !! EvalResult                        ;; async evaluation begins
  ;; Phase 5: Active — the formula is now providing its value
  Formula-Active

session Formula-Active
  rec Active
    &>                                 ;; external choice: what happens to us?
      | :provide ->
          ?? ProvideRequest            ;; someone requests our value
          !! Value                     ;; we provide it (memoized)
          Active
      | :cancel ->
          ?? CancelSignal              ;; cancellation requested
          Formula-Teardown
      | :gc-collect ->
          ?? GCCollect                 ;; garbage collector reached us
          Formula-Teardown

session Formula-Teardown
  ;; Notify dependents of cancellation
  !! CancelCascade                     ;; thisDiesIfThatDies dependents
  ;; Run cleanup hooks
  !! DisposeSignal                     ;; onCancel hooks execute
  ;; Remove from graph
  ! FormulaRemoval                     ;; delete from in-memory maps + disk
  end
#+end_src

** 5.3 Critical Ordering: Synchronous Controller Creation

A subtle but important invariant: controllers are created /synchronously/
(before any =await=) during formula registration. The Endo source comments
explain why:

#+begin_quote
"The controller must be created synchronously to ensure that a re-entrant
call to =provide= during the same formula graph job does not fail to find
the controller."
#+end_quote

In session type terms, this means the =! Controller= step in
=Formula-Lifecycle= /must not/ be an =!! Controller= (async). The
synchronous send ensures that the controller is visible to any concurrent
=provide= call before the async evaluation begins. Session types make this
ordering constraint explicit --- changing =!= to =!!=  would be a type error
if any downstream protocol depends on the controller's synchronous
availability.

** 5.4 Transient Pinning

Newly created formulas face a race condition: between creation and the
establishment of a pet-name reference, the formula has no incoming edges and
could be garbage-collected. Endo resolves this with /transient pinning/:

#+begin_src prologos
;; --- Pin Protocol ---
;; Protects a formula from GC during the window between
;; creation and naming.

session Pin-Guard
  ! FormulaIdentifier            ;; pin the formula
  Pin-Protected

session Pin-Protected
  rec Pinned
    +>
      | :name-established ->
          ! PetName              ;; the formula now has a named reference
          ! Unpin                ;; safe to unpin
          end
      | :abandon ->
          ! Unpin                ;; no name was established; formula may be GC'd
          end
#+end_src

*Protocol-level issue*: The pin protocol has no /timeout/. If a formula is
pinned and the naming step never completes (e.g., due to a crash between
=pinTransient= and the pet-store write), the pin leaks. Session types could
enforce a bounded liveness property here --- requiring that every
=Pin-Guard= eventually reaches =Unpin=.


* 6. Agent Protocols

Endo has two primary agent types, =Host= and =Guest=, with the Guest being
a capability-attenuated version of the Host.

