docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
** 6.1 Host Agent

The Host is the most powerful agent type. It can create workers, evaluate
code, manage guests, handle invitations, and access the full Endo system.

#+begin_src prologos
;; --- Host Agent Protocol ---
;; The host is the "root of authority" for its subtree of capabilities.

session Host-Protocol
  rec HostOps
    &>                                    ;; offer to handle requests
      ;; --- Code Execution ---
      | :evaluate ->
          ?? EvalRequest                  ;; receive: worker, source, endowments
          !! EvalResult                   ;; async: result of evaluation
          HostOps
      | :make-unconfined ->
          ?? UnconfinedRequest            ;; receive: specifier, powers
          !! EvalResult                   ;; async: imported module result
          HostOps
      | :make-bundle ->
          ?? BundleRequest                ;; receive: readable, powers
          !! EvalResult                   ;; async: bundle evaluation result
          HostOps
      ;; --- Agent Management ---
      | :make-host ->
          ?? HostRequest                  ;; create a new sub-host
          !! FormulaIdentifier            ;; async: the new host's ID
          HostOps
      | :make-guest ->
          ?? GuestRequest                 ;; create a reduced-authority guest
          !! FormulaIdentifier            ;; async: the new guest's ID
          HostOps
      ;; --- Capability Management ---
      | :store-value ->
          ?? StoreValueRequest            ;; receive: pet name + value
          ! Acknowledgment               ;; stored (sync — disk write)
          HostOps
      | :store-blob ->
          ?? StoreBlobRequest             ;; receive: pet name + bytes
          ! Acknowledgment
          HostOps
      | :lookup ->
          ?? LookupRequest               ;; receive: pet name to resolve
          !! Value                        ;; async: the resolved capability
          HostOps
      | :remove ->
          ?? RemoveRequest               ;; receive: pet name to delete
          ! Acknowledgment               ;; GC may trigger
          HostOps
      ;; --- Invitation Protocol ---
      | :invite ->
          ?? InviteRequest               ;; create an invitation
          !! Invitation                   ;; async: invitation bytes
          HostOps
      | :accept ->
          ?? AcceptRequest               ;; accept an invitation
          !! FormulaIdentifier           ;; async: the new peer's handle
          HostOps
      ;; --- Messaging ---
      | :send ->
          ?? SendRequest                 ;; send a message/package
          ! Acknowledgment
          HostOps
      | :request ->
          ?? RequestMsg                  ;; send a request (expects response)
          ?? Resolution                  ;; await resolution
          HostOps
      ;; --- Lifecycle ---
      | :cancel ->
          ?? CancelRequest               ;; cancel a named capability
          ! Acknowledgment
          HostOps
#+end_src

** 6.2 Guest Agent

The Guest is a capability-attenuated view. It /cannot/ directly create
workers, hosts, or guests. Instead, it must /request/ evaluation through
a messaging protocol that the host (or an evaluator agent) must approve.

#+begin_src prologos
;; --- Guest Agent Protocol ---
;; Guests have a reduced method set compared to hosts.
;; They can evaluate code only if the host grants permission.

session Guest-Protocol
  rec GuestOps
    &>
      | :request-eval ->
          ?? EvalRequestFromGuest        ;; guest wants to evaluate code
          !! RequestAcknowledgment       ;; the request is registered
          ;; The host will receive a message and must approve.
          ;; The guest awaits the result via its mailbox.
          GuestOps
      | :lookup ->
          ?? LookupRequest
          !! Value
          GuestOps
      | :store-value ->
          ?? StoreValueRequest
          ! Acknowledgment
          GuestOps
      | :list ->
          ?? ListRequest
          !! [List PetName]
          GuestOps
      | :follow-names ->
          ?? FollowRequest
          Guest-NameStream
      | :send ->
          ?? SendRequest
          ! Acknowledgment
          GuestOps
      | :request ->
          ?? RequestMsg
          ?? Resolution
          GuestOps

session Guest-NameStream
  rec Stream
    ?? NameChange                         ;; receive name change notification
    Stream
#+end_src

** 6.3 Capability Attenuation: Host → Guest

The Host-to-Guest relationship is a classic OCap /attenuation/ pattern. The
Guest has strictly fewer methods than the Host. In Prologos's session type
system, this is captured by /subtyping/: =Guest-Protocol= is a subtype of
=Host-Protocol= (it offers a subset of the choices). Any code that works
with a =Guest-Protocol= session will also work with a =Host-Protocol=
session, but not vice versa.

#+begin_src prologos
;; The subtyping relationship (conceptual):
;; Host-Protocol <: Guest-Protocol   (Host offers MORE choices)
;;
;; But session subtyping inverts for offers (&>):
;; If Guest offers fewer options, Host is "wider" — so
;; Host-Protocol is a subtype of Guest-Protocol for clients.
;;
;; This captures the OCap attenuation: a Host can be used
;; anywhere a Guest is expected, but not the reverse.
#+end_src


* 7. Worker Isolation Protocol

Workers are sandboxed JavaScript execution environments. They run in
separate OS processes, communicating with the daemon exclusively through
CapTP over stdin/stdout pipes.

#+begin_src prologos
;; --- Worker Protocol ---
;; The daemon is the sole initiator; the worker is purely reactive.

session Worker-Protocol
  rec WorkerOps
    +>                                     ;; daemon chooses what to send
      | :evaluate ->
          !! EvalCommand                   ;; send: source, names, values
          ?? EvalResult                    ;; receive: evaluation result
          WorkerOps
      | :make-unconfined ->
          !! UnconfinedCommand             ;; send: specifier, powers
          ?? EvalResult
          WorkerOps
      | :make-bundle ->
          !! BundleCommand                 ;; send: readable, powers
          ?? EvalResult
          WorkerOps
      | :terminate ->
          !! TerminateCommand              ;; send: shutdown signal
          end
#+end_src

The worker protocol has an important asymmetry: /the worker never initiates
a call/. The daemon holds the worker facet (received as the worker's CapTP
bootstrap), and all interaction is daemon-to-worker. The worker can only
respond to calls.

This asymmetry is captured by the session type: the daemon side uses =+>=
(internal choice --- it decides which operation to perform), while the dual
worker side uses =&>= (external choice --- it must be prepared to handle
any operation the daemon selects).

#+begin_src prologos
;; --- Worker Sandboxing ---
;; The Compartment endowments define the worker's capability surface.

type WorkerEndowments
  :assert     AssertCapability
  :console    ConsoleCapability
  :e          EventualSendProxy
  :far        FarMaker
  :make-exo   ExoMaker
  :m          MethodGuard
  :text-encoder TextEncoderCap
  :text-decoder TextDecoderCap
  :url        URLConstructor

;; Note: The worker does NOT receive filesystem, network, or process
;; capabilities. All authority must come through the capability arguments
;; passed in the evaluate/makeUnconfined/makeBundle calls.
#+end_src


* 8. Pet Store: Capability Naming Protocol

The pet store is Endo's capability naming layer. Each agent has its own
pet store with its own names --- there is no global namespace. This
implements the /pet name/ pattern from capability security literature.

