docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
** 8.1 Core Protocol

#+begin_src prologos
;; --- Pet Store Protocol ---
;; A local, per-agent namespace for capabilities.

session PetStore-Protocol
  rec StoreOps
    &>
      | :write ->
          ?? WriteRequest                  ;; { petName, formulaIdentifier }
          ! WriteAck                       ;; persisted to disk
          StoreOps
      | :remove ->
          ?? RemoveRequest                 ;; { petName }
          ! RemoveAck                      ;; edge removed, GC may trigger
          StoreOps
      | :rename ->
          ?? RenameRequest                 ;; { fromName, toName }
          ! RenameAck
          StoreOps
      | :identify ->
          ?? IdentifyRequest               ;; { petName }
          ! [Option FormulaIdentifier]     ;; Some if found, None if not
          StoreOps
      | :reverse-identify ->
          ?? ReverseIdRequest              ;; { formulaIdentifier }
          ! [List PetName]                 ;; all names for this formula
          StoreOps
      | :list ->
          ?? ListRequest
          ! [List PetName]                 ;; sorted list of all names
          StoreOps
      | :follow ->
          ?? FollowRequest
          PetStore-ChangeStream
      | :follow-id ->
          ?? FollowIdRequest               ;; { formulaIdentifier }
          PetStore-IdChangeStream

session PetStore-ChangeStream
  rec Changes
    !! NameChange                          ;; async: push change notification
    Changes

type NameChange
  := NameAdded PetName FormulaIdentifier
   | NameRemoved PetName FormulaIdentifier
#+end_src

** 8.2 Bidirectional Mapping

The pet store maintains a bidirectional mapping: name → formulaId /and/
formulaId → [names]. This enables both =identifyLocal= (name → id) and
=reverseIdentify= (id → names) in O(1). The session type exposes both
directions as separate protocol steps.

** 8.3 Protocol-Level Observation: Write Ordering

Pet store writes are persisted to the filesystem. The =WriteAck= is sent
/after/ the disk write completes. This is a synchronous =!= (not =!!=)
because the caller needs to know that the name is durably recorded before
proceeding. If we changed this to =!! WriteAck= (async), we would lose
the persistence guarantee --- a crash between the async ack and the actual
write would leave the in-memory mapping inconsistent with disk.

This is a good example of where the choice between =!= and =!!= in the
session type encodes a /correctness requirement/, not just a performance
preference.


* 9. Mail and Messaging Protocol

The mail system enables agents to communicate with each other. Messages carry
capability references (as formula identifiers), enabling the /capability
introduction/ pattern: Agent A introduces a capability to Agent B by
including it as a message edge.

** 9.1 Message Types

#+begin_src prologos
;; --- Message Type Hierarchy ---

type Message
  := RequestMessage Nat Nat Description [List PetName]
   | PackageMessage Nat Nat [List String] [Map String FormulaIdentifier]
   | EvalRequestMessage Nat Nat Source [List PetName] [List PetName] PetName
   | DefinitionMessage Nat FormulaIdentifier PetName
   | FormMessage Nat Nat Description [List String]
   | ValueMessage Nat Nat Value
   | EvalProposalReviewer Nat Nat Source [List PetName] [List PetName] PetName
   | EvalProposalProposer Nat Nat Source [List PetName] [List PetName] PetName
#+end_src

** 9.2 Mail Protocol

#+begin_src prologos
;; --- Mailbox Protocol ---
;; Agents send and receive messages through their mailbox.

session Mailbox-Send
  +>
    | :send-package ->
        !! PackageMessage                  ;; async: send a package to a recipient
        end
    | :send-request ->
        !! RequestMessage                  ;; async: send a request
        ?? Resolution                      ;; await: resolution from recipient
        end
    | :send-eval-request ->
        !! EvalRequestMessage              ;; async: request code evaluation
        ?? EvalResult                      ;; await: evaluation result
        end
    | :send-value ->
        !! ValueMessage                    ;; async: send a raw value
        end
    | :send-form ->
        !! FormMessage                     ;; async: send an interactive form
        ?? FormSubmission                  ;; await: submitted values
        end

session Mailbox-Receive
  rec Inbox
    ?? Message                             ;; receive any message type
    +>                                     ;; choose how to handle it
      | :adopt ->
          ! AdoptRequest                   ;; claim a capability edge
          Inbox
      | :resolve ->
          ! ResolveResponse                ;; fulfill a request
          Inbox
      | :reject ->
          ! RejectResponse                 ;; reject a request
          Inbox
      | :dismiss ->
          ! DismissSignal                  ;; discard the message
          Inbox
      | :submit ->
          ! FormSubmission                 ;; submit form values
          Inbox
      | :grant-evaluate ->
          ! GrantSignal                    ;; approve an eval proposal
          Inbox
      | :counter-evaluate ->
          ! CounterProposal               ;; send a counter-proposal
          Inbox
#+end_src

** 9.3 Capability Introduction Pattern

When Agent A sends a message to Agent B that includes capability references:

#+begin_src prologos
;; --- Capability Introduction ---
;; A three-party protocol: sender, daemon, recipient.

session Capability-Introduction
  ;; Phase 1: Sender references capabilities by local pet name
  ! [List PetName]                         ;; sender's pet names

  ;; Phase 2: Daemon resolves names to formula identifiers
  ;; (internal — not visible as a protocol step to sender/recipient)

  ;; Phase 3: Message is stored with formula identifiers as edges
  ! [Map String FormulaIdentifier]         ;; edges: edgeName -> formulaId

  ;; Phase 4: Recipient adopts edges under their own pet names
  rec Adopt
    +>
      | :adopt-edge ->
          ? String                         ;; edge name in the message
          ? PetName                        ;; recipient's chosen pet name
          Adopt
      | :done ->
          end
#+end_src

This is the mechanism by which capabilities flow between agents while
maintaining the pet-name discipline: each agent only sees their own names,
never the other's. The daemon mediates the translation through formula
identifiers.


* 10. Garbage Collection Protocol

The formula graph's garbage collector is a critical correctness component.
It determines which formulas are still reachable and cancels/removes those
that are not.

