docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
** 10.1 GC Algorithm as Protocol Steps

#+begin_src prologos
;; --- Garbage Collection Protocol ---
;; The 10-step GC sweep, modeled as a session.

session GC-Sweep
  ;; Step 1: Assign union-find groups
  ! GroupAssignment                        ;; merge handle+agent, promise+resolver

  ;; Step 2: Build dependency graph at group level
  ! [Map GroupId [Set GroupId]]            ;; group -> dependent groups

  ;; Step 3: Count references to each group
  ! [Map GroupId Nat]                      ;; group -> reference count

  ;; Step 4: Identify root set + reachable groups
  ! [Set GroupId]                          ;; permanently rooted groups
  ! [Set GroupId]                          ;; transitively reachable groups

  ;; Step 5: Identify unreachable groups for collection
  ! [Set GroupId]                          ;; groups to collect

  ;; Step 6: Cancel unreachable formulas (cascading)
  !! CancelBatch                           ;; async: cancel signals sent

  ;; Step 7: Drop CapTP references for collected formulas
  !! DropBatch                             ;; async: CTP_DROP sent to peers

  ;; Step 8: Disconnect CapTP sessions for collected formulas
  !! DisconnectBatch                       ;; async: CTP_DISCONNECT sent

  ;; Step 9: Delete formulas from disk
  ! DeleteBatch                            ;; sync: filesystem deletion

  ;; Step 10: Clear dirty flag
  ! GCComplete
  end
#+end_src

** 10.2 GC Trigger Protocol

GC does not run continuously. It is triggered by =withCollection=, a wrapper
that runs a user-facing operation and then triggers collection if the graph
is dirty:

#+begin_src prologos
;; --- withCollection ---
;; Every capability-affecting operation is wrapped in withCollection.

session WithCollection {A : Type}
  ! Operation                              ;; the user-facing operation
  ?? A                                     ;; its result (async)
  +>
    | :graph-dirty ->
        GC-Sweep                           ;; trigger collection
    | :graph-clean ->
        end                                ;; no collection needed
#+end_src

** 10.3 Protocol-Level Observations

*Promise resolution ordering*: When a promise resolves, the daemon writes
the resolved formula identifier as a pet store entry /before/ writing the
resolution status. This ensures that the GC sees the new reference edge
before it sees that the promise is resolved. If this ordering were reversed,
a GC sweep between the status write and the edge write could collect the
target formula. Session types make this ordering constraint explicit:

#+begin_src prologos
;; --- Promise Resolution Ordering ---
;; The edge must be written before the status, or GC could
;; collect the target formula.

session Promise-Resolution-Safe
  ! PetStoreEdge                           ;; write: name -> resolved formula (FIRST)
  ! ResolutionStatus                       ;; write: promise is resolved (SECOND)
  end

;; INCORRECT ordering would be:
;; session Promise-Resolution-Unsafe
;;   ! ResolutionStatus                    ;; write status first — DANGER
;;   ! PetStoreEdge                        ;; GC could run between these two steps!
;;   end
#+end_src

*Distributed GC via CTP_DROP*: When a formula is collected, any CapTP
connections that were importing it must be notified. The =CTP_DROP= message
decrements the remote reference count. If the count reaches zero, the remote
side can collect its proxy. This is modeled by the =DropBatch= step in
=GC-Sweep=.


* 11. Invitation and Peering Protocol

Endo supports cross-daemon capability sharing through an invitation
protocol.

#+begin_src prologos
;; --- Invitation Protocol ---
;; A two-phase protocol for establishing a peering relationship.

;; Phase 1: The inviting host creates an invitation
session Create-Invitation
  ! NetworkId                              ;; which network to use
  ! InvitationBytes                        ;; cryptographic invitation token
  !! InvitationFormula                     ;; async: formula registered in graph
  end

;; Phase 2: The accepting host uses the invitation
session Accept-Invitation
  ? InvitationBytes                        ;; receive the invitation token
  ;; Validate the invitation against the network
  ?? PeerHandle                            ;; async: the new peer's handle
  ;; The peer is now a named formula in the accepting host's store
  ! PetName                               ;; assign a local name to the peer
  end

;; The full peering handshake composes both phases:
session Peering-Handshake
  ;; Inviting side:
  Create-Invitation
  ;; ... invitation bytes are transferred out-of-band ...
  ;; Accepting side:
  Accept-Invitation
  ;; Both sides now have CapTP connections to each other.
  CapTP-Bootstrap
#+end_src

The invitation protocol is interesting because the invitation bytes travel
/out-of-band/ (e.g., via email, QR code, or another communication channel).
The session type cannot model the out-of-band transfer directly, but it can
model the two sides independently and verify that their composed types are
compatible.


* 12. Cancellation and Context Protocol

Each formula has a =Context= that manages its lifecycle dependencies and
cancellation cascade.

#+begin_src prologos
;; --- Cancellation Context ---
;; The cascading cancellation protocol.

type ContextDependency
  := ThisDiesIfThatDies FormulaIdentifier
   | ThatDiesIfThisDies FormulaIdentifier

session Context-Protocol
  rec ContextOps
    &>
      | :add-dependency ->
          ?? ContextDependency             ;; register a liveness dependency
          ContextOps
      | :add-cancel-hook ->
          ?? CancelHook                    ;; register a cleanup callback
          ContextOps
      | :cancel ->
          ?? CancelSignal                  ;; cancellation initiated
          Context-Cancel-Cascade
      | :dispose ->
          ?? DisposeSignal                 ;; external disposal request
          Context-Dispose

session Context-Cancel-Cascade
  ;; 1. Mark as cancelled (reject the cancelled promise)
  ! CancelledNotification
  ;; 2. Cancel all dependents (thatDiesIfThisDies)
  !! [List CancelSignal]                   ;; async: cascade to dependents
  ;; 3. Run cleanup hooks
  !! [List HookResult]                     ;; async: execute onCancel hooks
  ;; 4. Resolve the disposed promise
  ! DisposedNotification
  end

session Context-Dispose
  ;; Run cleanup hooks
  !! [List HookResult]
  ! DisposedNotification
  end
#+end_src

*Protocol-level observation*: The cancellation cascade creates a directed
acyclic graph of liveness dependencies. If this graph has a cycle, a
formula's cancellation would cascade back to itself, potentially causing
infinite recursion. Session types with recursive structure can detect such
cycles statically. The =ContextDependency= type encodes the direction of the
dependency --- =ThisDiesIfThatDies= vs =ThatDiesIfThisDies= --- and a
static analysis can verify that the dependency graph is acyclic.


