docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
* 13. Connection and Remote Control

The =RemoteControl= type in Endo represents the state machine for a peering
connection.

#+begin_src prologos
;; --- Remote Control State Machine ---
;; Tracks the lifecycle of a connection to a remote peer.

type RemoteControlState
  := Pending                               ;; connection not yet established
   | Connected CapTPConnection             ;; active connection
   | Disconnected DisconnectReason         ;; connection closed
   | Failed Error                          ;; connection failed

session RemoteControl-Protocol
  ;; Initial state: pending
  ?? ConnectionAttempt                     ;; receive connection parameters
  +>
    | :connect-success ->
        ! Connected                        ;; report connected state
        RemoteControl-Active
    | :connect-failure ->
        ! Failed                           ;; report failure
        end

session RemoteControl-Active
  rec Active
    &>
      | :send-message ->
          ?? CapTP-Message                 ;; receive message to send
          !! DeliveryResult                ;; async: delivery outcome
          Active
      | :receive-message ->
          ?? CapTP-Message                 ;; receive message from remote
          Active
      | :disconnect ->
          ?? DisconnectRequest
          ! Disconnected
          end
      | :connection-lost ->
          ?? ConnectionError
          ! Disconnected
          end
#+end_src


* 14. Composed Protocol: Full Daemon Bootstrap

The full Endo daemon bootstrap sequence composes many of the protocols above:

#+begin_src prologos
;; --- Full Daemon Bootstrap ---
;; This is the composition of all protocols involved in starting
;; the Endo daemon and processing its first client request.

session Daemon-Bootstrap
  ;; Phase 1: Formula graph initialization
  Formula-Lifecycle                        ;; create the Endo root formula
  Formula-Lifecycle                        ;; create networks formula
  Formula-Lifecycle                        ;; create pins formula
  Formula-Lifecycle                        ;; create main worker
  Formula-Lifecycle                        ;; create host agent

  ;; Phase 2: Socket listener
  ?? ClientConnection                      ;; accept Unix socket connection

  ;; Phase 3: CapTP handshake
  CapTP-Bootstrap                          ;; exchange bootstrap capabilities

  ;; Phase 4: Steady-state operation
  Daemon-Steady

session Daemon-Steady
  rec Steady
    &>
      ;; Accept new client connections
      | :new-client ->
          ?? ClientConnection
          CapTP-Bootstrap
          Steady
      ;; Process existing client requests
      | :client-request ->
          ?? CapTP-Message
          ;; Route to appropriate agent protocol
          +>
            | :host-op -> Host-Protocol
            | :guest-op -> Guest-Protocol
            | :worker-op -> Worker-Protocol
          Steady
      ;; Manage lifecycle
      | :gc-trigger ->
          WithCollection
          Steady
      ;; Shutdown
      | :shutdown ->
          !! ShutdownSignal
          ;; Cancel all formulas
          GC-Sweep
          end
#+end_src

This composition demonstrates the power of named session types as protocol
building blocks. Each named session (=Formula-Lifecycle=, =CapTP-Bootstrap=,
=Host-Protocol=, etc.) is independently verifiable, and their composition
is verified at the type level.


* 15. Protocol-Level Issues and Recommendations

The session type analysis reveals several protocol-level properties that are
currently implicit in the Endo codebase but could benefit from being made
explicit and statically verified.

** 15.1 Mutex Re-Entrancy

The formula graph mutex (=formulaGraphJobs=) serializes all graph mutations.
The code includes re-entrancy detection, logging a warning if a formula
operation re-enters the mutex. But this is a runtime check.

*Session type approach*: Model the mutex as a session with a /linear/
acquire-release protocol:

#+begin_src prologos
;; --- Mutex Protocol ---
;; Linear typing ensures acquire/release pairing.

session Mutex-Protocol
  ? MutexToken [1]                         ;; acquire: linear — must be used exactly once
  ;; ... critical section ...
  ! MutexToken [1]                         ;; release: returns the token
  end

;; Re-entrancy is a type error: if you hold a MutexToken,
;; attempting to acquire another would require TWO tokens,
;; but the mutex session only provides one.
#+end_src

Linearity prevents re-entrancy /statically/ --- you cannot acquire a linear
token while already holding one.

** 15.2 Pin Leak Prevention

As noted in Section 5.4, the transient pin protocol has no timeout or
bounded liveness guarantee. A crash between =pinTransient= and the
corresponding =unpinTransient= leaves a permanent pin.

*Session type approach*: Model the pin as a linear resource:

#+begin_src prologos
;; --- Linear Pin ---
;; The pin MUST be consumed (unpinned). Linearity prevents leaks.

session Pin-Linear
  ? PinToken [1]                           ;; acquire pin: linear
  ;; ... naming operations ...
  ! PinToken [1]                           ;; release pin: MUST happen
  end

;; Dropping a linear PinToken without consuming it is a type error.
;; This catches pin leaks at compile time.
#+end_src

** 15.3 Promise Resolution GC Ordering

Section 10.3 described the critical ordering requirement for promise
resolution: the pet store edge must be written /before/ the resolution
status. This is currently enforced by code ordering (sequential statements),
which is fragile under refactoring.

*Session type approach*: The ordering is explicit in the
=Promise-Resolution-Safe= session type. Any refactoring that swaps the two
writes would be a type error, because the session's continuation structure
enforces the order.

** 15.4 CTP_DROP Before CTP_DISCONNECT

During GC, the daemon must send =CTP_DROP= messages to decrement reference
counts /before/ sending =CTP_DISCONNECT= to close connections. If the order
is reversed, the remote side may not process the drops before the connection
closes, leaving stale references.

#+begin_src prologos
;; --- GC Network Cleanup Ordering ---

session GC-Network-Cleanup
  ;; Drops MUST precede disconnect
  !! [List CTP-Drop]                       ;; send all reference decrements
  !! CTP-Disconnect                        ;; THEN close the connection
  end

;; The session type enforces: Drop < Disconnect
;; Swapping them would change the session type and be caught by the checker.
#+end_src

** 15.5 Formula Type Dispatch Completeness

The daemon dispatches on formula type in =formulate= and several other
functions. If a new formula type is added but a dispatch case is missed,
it manifests as a runtime =undefined= error.

*Session type approach*: Model the formula dispatch as an external choice
(=&>=) with one branch per formula type. The session type checker verifies
that all branches are handled. Adding a new formula type without adding
the corresponding handler is a type error:

#+begin_src prologos
;; --- Formula Type Dispatch ---
;; Exhaustive matching enforced by session type.

session Formula-Dispatch
  &>
    | :endo -> ...
    | :host -> ...
    | :guest -> ...
    | :eval -> ...
    | :worker -> ...
    | :handle -> ...
    | :promise -> ...
    | :resolver -> ...
    ;; ... all 26+ formula types ...
    ;; Missing a case is a type error.
#+end_src

