docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.tex
\section{13. Connection and Remote Control}
\label{sec:org4b28f10}

The \texttt{RemoteControl} type in Endo represents the state machine for a peering
connection.

\begin{verbatim}
;; --- Remote Control State Machine ---
;; Tracks the lifecycle of a connection to a remote peer.

type RemoteControlState
  := Pending                               ;; connection not yet established
   | Connected CapTPConnection             ;; active connection
   | Disconnected DisconnectReason         ;; connection closed
   | Failed Error                          ;; connection failed

session RemoteControl-Protocol
  ;; Initial state: pending
  ?? ConnectionAttempt                     ;; receive connection parameters
  +>
    | :connect-success ->
        ! Connected                        ;; report connected state
        RemoteControl-Active
    | :connect-failure ->
        ! Failed                           ;; report failure
        end

session RemoteControl-Active
  rec Active
    &>
      | :send-message ->
          ?? CapTP-Message                 ;; receive message to send
          !! DeliveryResult                ;; async: delivery outcome
          Active
      | :receive-message ->
          ?? CapTP-Message                 ;; receive message from remote
          Active
      | :disconnect ->
          ?? DisconnectRequest
          ! Disconnected
          end
      | :connection-lost ->
          ?? ConnectionError
          ! Disconnected
          end
\end{verbatim}
\section{14. Composed Protocol: Full Daemon Bootstrap}
\label{sec:orgb8ccfc8}

The full Endo daemon bootstrap sequence composes many of the protocols above:

\begin{verbatim}
;; --- Full Daemon Bootstrap ---
;; This is the composition of all protocols involved in starting
;; the Endo daemon and processing its first client request.

session Daemon-Bootstrap
  ;; Phase 1: Formula graph initialization
  Formula-Lifecycle                        ;; create the Endo root formula
  Formula-Lifecycle                        ;; create networks formula
  Formula-Lifecycle                        ;; create pins formula
  Formula-Lifecycle                        ;; create main worker
  Formula-Lifecycle                        ;; create host agent

  ;; Phase 2: Socket listener
  ?? ClientConnection                      ;; accept Unix socket connection

  ;; Phase 3: CapTP handshake
  CapTP-Bootstrap                          ;; exchange bootstrap capabilities

  ;; Phase 4: Steady-state operation
  Daemon-Steady

session Daemon-Steady
  rec Steady
    &>
      ;; Accept new client connections
      | :new-client ->
          ?? ClientConnection
          CapTP-Bootstrap
          Steady
      ;; Process existing client requests
      | :client-request ->
          ?? CapTP-Message
          ;; Route to appropriate agent protocol
          +>
            | :host-op -> Host-Protocol
            | :guest-op -> Guest-Protocol
            | :worker-op -> Worker-Protocol
          Steady
      ;; Manage lifecycle
      | :gc-trigger ->
          WithCollection
          Steady
      ;; Shutdown
      | :shutdown ->
          !! ShutdownSignal
          ;; Cancel all formulas
          GC-Sweep
          end
\end{verbatim}

This composition demonstrates the power of named session types as protocol
building blocks. Each named session (\texttt{Formula-Lifecycle}, \texttt{CapTP-Bootstrap},
\texttt{Host-Protocol}, etc.) is independently verifiable, and their composition
is verified at the type level.
\section{15. Protocol-Level Issues and Recommendations}
\label{sec:org35c65a1}

The session type analysis reveals several protocol-level properties that are
currently implicit in the Endo codebase but could benefit from being made
explicit and statically verified.
\subsection{15.1 Mutex Re-Entrancy}
\label{sec:org7cf0b6e}

The formula graph mutex (\texttt{formulaGraphJobs}) serializes all graph mutations.
The code includes re-entrancy detection, logging a warning if a formula
operation re-enters the mutex. But this is a runtime check.

\textbf{Session type approach}: Model the mutex as a session with a \emph{linear}
acquire-release protocol:

\begin{verbatim}
;; --- Mutex Protocol ---
;; Linear typing ensures acquire/release pairing.

session Mutex-Protocol
  ? MutexToken [1]                         ;; acquire: linear — must be used exactly once
  ;; ... critical section ...
  ! MutexToken [1]                         ;; release: returns the token
  end

;; Re-entrancy is a type error: if you hold a MutexToken,
;; attempting to acquire another would require TWO tokens,
;; but the mutex session only provides one.
\end{verbatim}

Linearity prevents re-entrancy \emph{statically} --- you cannot acquire a linear
token while already holding one.
\subsection{15.2 Pin Leak Prevention}
\label{sec:orga57e340}

As noted in Section 5.4, the transient pin protocol has no timeout or
bounded liveness guarantee. A crash between \texttt{pinTransient} and the
corresponding \texttt{unpinTransient} leaves a permanent pin.

\textbf{Session type approach}: Model the pin as a linear resource:

\begin{verbatim}
;; --- Linear Pin ---
;; The pin MUST be consumed (unpinned). Linearity prevents leaks.

session Pin-Linear
  ? PinToken [1]                           ;; acquire pin: linear
  ;; ... naming operations ...
  ! PinToken [1]                           ;; release pin: MUST happen
  end

;; Dropping a linear PinToken without consuming it is a type error.
;; This catches pin leaks at compile time.
\end{verbatim}
\subsection{15.3 Promise Resolution GC Ordering}
\label{sec:org34a9720}

Section 10.3 described the critical ordering requirement for promise
resolution: the pet store edge must be written \emph{before} the resolution
status. This is currently enforced by code ordering (sequential statements),
which is fragile under refactoring.

\textbf{Session type approach}: The ordering is explicit in the
\texttt{Promise-Resolution-Safe} session type. Any refactoring that swaps the two
writes would be a type error, because the session's continuation structure
enforces the order.
\subsection{15.4 CTP\textsubscript{DROP} Before CTP\textsubscript{DISCONNECT}}
\label{sec:orgf05711d}

During GC, the daemon must send \texttt{CTP\_DROP} messages to decrement reference
counts \emph{before} sending \texttt{CTP\_DISCONNECT} to close connections. If the order
is reversed, the remote side may not process the drops before the connection
closes, leaving stale references.

\begin{verbatim}
;; --- GC Network Cleanup Ordering ---

session GC-Network-Cleanup
  ;; Drops MUST precede disconnect
  !! [List CTP-Drop]                       ;; send all reference decrements
  !! CTP-Disconnect                        ;; THEN close the connection
  end

;; The session type enforces: Drop < Disconnect
;; Swapping them would change the session type and be caught by the checker.
\end{verbatim}
\subsection{15.5 Formula Type Dispatch Completeness}
\label{sec:orgc59ecb4}

The daemon dispatches on formula type in \texttt{formulate} and several other
functions. If a new formula type is added but a dispatch case is missed,
it manifests as a runtime \texttt{undefined} error.

\textbf{Session type approach}: Model the formula dispatch as an external choice
(\texttt{\&>}) with one branch per formula type. The session type checker verifies
that all branches are handled. Adding a new formula type without adding
the corresponding handler is a type error:

\begin{verbatim}
;; --- Formula Type Dispatch ---
;; Exhaustive matching enforced by session type.

session Formula-Dispatch
  &>
    | :endo -> ...
    | :host -> ...
    | :guest -> ...
    | :eval -> ...
    | :worker -> ...
    | :handle -> ...
    | :promise -> ...
    | :resolver -> ...
    ;; ... all 26+ formula types ...
    ;; Missing a case is a type error.
\end{verbatim}
