docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
** 15.6 Mailbox Message Number Monotonicity

Mailbox messages are numbered with a monotonically increasing =bigint=
counter. But the mailbox protocol does not enforce that responses reference
valid (existing) message numbers. A =resolve(999, ...)= where message 999
does not exist is a runtime error.

*Session type approach*: Use dependent session types to bind the message
number at receive time and constrain it at response time:

#+begin_src prologos
;; --- Dependent Message Numbers ---

session Mailbox-Receive-Dep
  rec Inbox
    ?: msgNum Nat                          ;; dependent recv: binds msgNum
    ?? [Message msgNum]                    ;; the message, indexed by its number
    +>
      | :resolve ->
          ! [Resolution msgNum]            ;; MUST reference the same msgNum
          Inbox
      | :dismiss ->
          ! [Dismiss msgNum]
          Inbox
#+end_src


* 16. Summary of Session Type Mappings

| Endo Component              | Session Type              | Key Operators  |
|-----------------------------+---------------------------+----------------|
| CapTP handshake             | =CapTP-Bootstrap=         | =!! ??=        |
| CapTP steady-state          | =CapTP-Steady=            | =!! ?? +> &>=  |
| Indexed CapTP call          | =CapTP-Call {qid}=        | =!! ??= (dep.) |
| Formula lifecycle           | =Formula-Lifecycle=       | =! !! &>=      |
| Transient pinning           | =Pin-Guard=               | =! +=          |
| Host agent                  | =Host-Protocol=           | =?? !! &>=     |
| Guest agent                 | =Guest-Protocol=          | =?? !! &>=     |
| Worker sandboxing           | =Worker-Protocol=         | =!! ?? +>=     |
| Pet store                   | =PetStore-Protocol=       | =?? ! &>=      |
| Pet store change stream     | =PetStore-ChangeStream=   | =!!=           |
| Mailbox send                | =Mailbox-Send=            | =!! ?? +>=     |
| Mailbox receive             | =Mailbox-Receive=         | =?? ! +>=      |
| Capability introduction     | =Capability-Introduction= | =! ? +>=       |
| GC sweep                    | =GC-Sweep=                | =! !!=         |
| GC trigger                  | =WithCollection=          | =! ?? +>=      |
| Promise resolution ordering | =Promise-Resolution-Safe= | =!=            |
| Cancellation cascade        | =Context-Cancel-Cascade=  | =! !!=         |
| Invitation                  | =Create-/Accept-Invitation= | =! ?? !!=    |
| Remote control              | =RemoteControl-Protocol=  | =?? !! +> &>= |
| Mutex protocol              | =Mutex-Protocol=          | =? ! [1]=      |
| Daemon bootstrap            | =Daemon-Bootstrap=        | composed       |
| Daemon steady-state         | =Daemon-Steady=           | =&> +>=        |


* 17. Where Prologos Stands: System Modelling and Protocol Verification

** 17.1 What Prologos Can Do Today

Prologos is a Phase 0 research language with a working implementation in
Racket. Its current capabilities relevant to system modelling:

- *Session Types with Full Operator Set*: Prologos implements synchronous
  (=!/=?=), asynchronous (=!!/??=), dependent (=!:/??:=), choice (=+>/&>=),
  and recursive (=rec/end=) session type operators. Every session type in
  this document uses syntax that Prologos already parses, type-checks, and
  verifies.

- *Session Type Duality*: The type checker verifies that dual endpoints have
  compatible session types. This directly maps to CapTP's slot duality
  (=o+N= / =o-N=).

- *Linear Types (QTT)*: Prologos uses Quantitative Type Theory with
  multiplicities (=0=, =1=, =\omega=). Linear resources (multiplicity =1=)
  are used exactly once. This can model the mutex token, pin token, and
  capability transfer patterns described in this document.

- *Dependent Types*: Prologos has full dependent types with type-level
  computation, enabling indexed session types (=CapTP-Call {qid}=) and
  dependent message binding (=?: msgNum Nat=).

- *Propagator Network Substrate*: The underlying computation model is
  propagator networks, supporting monotone constraint propagation, partial
  information, and hypothetical reasoning (ATMS). This is the foundation
  for the session-derived effect ordering system.

- *Capability Type Annotations*: =[Cap C]= annotations on session types
  track which capabilities are required for each protocol step, composing
  alongside the protocol itself.

- *Protocol Composition via Named Sessions*: Named session types compose
  through type-level continuations --- exactly the mechanism used throughout
  this document to build complex protocols from simple building blocks.

** 17.2 What Prologos Is Building Toward

Several capabilities are in active development or planned:

- *Session-Derived Effect Ordering (Architecture A+D)*: The effect position
  lattice (recently completed) enables IO effects to be ordered by session
  type structure via a Galois connection. This means the ordering of
  capability operations in an Endo-like system would be derived from the
  session types --- not from ad-hoc code ordering --- and verified by the
  type checker.

- *Async Session Semantics*: The =!!/??= operators currently exist in the
  type system but their runtime semantics (buffered channels, promise
  pipelining) are not yet fully implemented. Full async session support
  would enable direct execution of the protocols modelled in this document.

- *Process Calculus Runtime*: Prologos's =proc= runtime supports
  multi-channel processes, but does not yet have network-transparent
  capability passing. Adding CapTP-like capability transport at the runtime
  level would enable Prologos processes to interact with Endo-style systems.

- *Static Deadlock Detection*: The transitive closure computation in the
  effect position lattice can detect cycles in cross-channel data
  dependencies, turning runtime deadlocks into compile-time errors. Applied
  to an Endo-like formula graph, this would detect circular liveness
  dependencies in the cancellation context.

- *Refinement Types for Protocol Properties*: With dependent types, Prologos
  can express refinement predicates over session states --- e.g., "this
  message number refers to an existing message" or "this slot ID refers to
  an exported object." These go beyond standard session types into
  property-rich protocol specifications.

** 17.3 The Unique Value Proposition

What makes Prologos uniquely suited to modelling systems like Endo is the
/convergence/ of multiple type system features:

1. *Session types* capture the communication protocol structure.
2. *Linear types* capture the resource discipline (capability transfer,
   mutex acquire/release, one-shot tokens).
3. *Dependent types* capture data-dependent protocol branching (indexed
   sessions, message-number-scoped responses).
4. *Capability annotations* track authority through protocol transitions.
5. *Propagator networks* provide the compositional, monotone reasoning
   substrate for effect ordering and constraint solving.

No other system currently combines all five. Existing tools offer subsets:

- *Scribble/mpst*: Session types, but no dependent types, linear types, or
  capability tracking.
- *Linear Haskell*: Linear types, but session types require encoding tricks
  and dependent types are limited.
- *Idris 2*: Dependent types with QTT multiplicities, but session types
  require encoding as indexed monads.
- *Rust*: Ownership/borrowing (affine types), but no session types or
  dependent types in the type system.

Prologos aims to be the first language where all five features are native
and compose naturally through the type system.

