docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.tex
\subsection{15.6 Mailbox Message Number Monotonicity}
\label{sec:org0aaae0f}

Mailbox messages are numbered with a monotonically increasing \texttt{bigint}
counter. But the mailbox protocol does not enforce that responses reference
valid (existing) message numbers. A \texttt{resolve(999, ...)} where message 999
does not exist is a runtime error.

\textbf{Session type approach}: Use dependent session types to bind the message
number at receive time and constrain it at response time:

\begin{verbatim}
;; --- Dependent Message Numbers ---

session Mailbox-Receive-Dep
  rec Inbox
    ?: msgNum Nat                          ;; dependent recv: binds msgNum
    ?? [Message msgNum]                    ;; the message, indexed by its number
    +>
      | :resolve ->
          ! [Resolution msgNum]            ;; MUST reference the same msgNum
          Inbox
      | :dismiss ->
          ! [Dismiss msgNum]
          Inbox
\end{verbatim}
\section{16. Summary of Session Type Mappings}
\label{sec:org8a011d1}

\begin{center}
\begin{tabular}{lll}
Endo Component & Session Type & Key Operators\\
\hline
CapTP handshake & \texttt{CapTP-Bootstrap} & \texttt{!! ??}\\
CapTP steady-state & \texttt{CapTP-Steady} & \texttt{!! ?? +> \&>}\\
Indexed CapTP call & \texttt{CapTP-Call \{qid\}} & \texttt{!! ??} (dep.)\\
Formula lifecycle & \texttt{Formula-Lifecycle} & \texttt{! !! \&>}\\
Transient pinning & \texttt{Pin-Guard} & \texttt{! +}\\
Host agent & \texttt{Host-Protocol} & \texttt{?? !! \&>}\\
Guest agent & \texttt{Guest-Protocol} & \texttt{?? !! \&>}\\
Worker sandboxing & \texttt{Worker-Protocol} & \texttt{!! ?? +>}\\
Pet store & \texttt{PetStore-Protocol} & \texttt{?? ! \&>}\\
Pet store change stream & \texttt{PetStore-ChangeStream} & \texttt{!!}\\
Mailbox send & \texttt{Mailbox-Send} & \texttt{!! ?? +>}\\
Mailbox receive & \texttt{Mailbox-Receive} & \texttt{?? ! +>}\\
Capability introduction & \texttt{Capability-Introduction} & \texttt{! ? +>}\\
GC sweep & \texttt{GC-Sweep} & \texttt{! !!}\\
GC trigger & \texttt{WithCollection} & \texttt{! ?? +>}\\
Promise resolution ordering & \texttt{Promise-Resolution-Safe} & \texttt{!}\\
Cancellation cascade & \texttt{Context-Cancel-Cascade} & \texttt{! !!}\\
Invitation & \texttt{Create-/Accept-Invitation} & \texttt{! ?? !!}\\
Remote control & \texttt{RemoteControl-Protocol} & \texttt{?? !! +> \&>}\\
Mutex protocol & \texttt{Mutex-Protocol} & \texttt{? ! [1]}\\
Daemon bootstrap & \texttt{Daemon-Bootstrap} & composed\\
Daemon steady-state & \texttt{Daemon-Steady} & \texttt{\&> +>}\\
\end{tabular}
\end{center}
\section{17. Where Prologos Stands: System Modelling and Protocol Verification}
\label{sec:orgb7f3033}

\subsection{17.1 What Prologos Can Do Today}
\label{sec:org6ea2862}

Prologos is a Phase 0 research language with a working implementation in
Racket. Its current capabilities relevant to system modelling:

\begin{itemize}
\item \textbf{Session Types with Full Operator Set}: Prologos implements synchronous
(\texttt{!/}?=), asynchronous (\texttt{!!/??}), dependent (\texttt{!:/??:}), choice (\texttt{+>/\&>}),
and recursive (\texttt{rec/end}) session type operators. Every session type in
this document uses syntax that Prologos already parses, type-checks, and
verifies.

\item \textbf{Session Type Duality}: The type checker verifies that dual endpoints have
compatible session types. This directly maps to CapTP's slot duality
(\texttt{o+N} / \texttt{o-N}).

\item \textbf{Linear Types (QTT)}: Prologos uses Quantitative Type Theory with
multiplicities (\texttt{0}, \texttt{1}, \texttt{\textbackslash{}omega}). Linear resources (multiplicity \texttt{1})
are used exactly once. This can model the mutex token, pin token, and
capability transfer patterns described in this document.

\item \textbf{Dependent Types}: Prologos has full dependent types with type-level
computation, enabling indexed session types (\texttt{CapTP-Call \{qid\}}) and
dependent message binding (\texttt{?: msgNum Nat}).

\item \textbf{Propagator Network Substrate}: The underlying computation model is
propagator networks, supporting monotone constraint propagation, partial
information, and hypothetical reasoning (ATMS). This is the foundation
for the session-derived effect ordering system.

\item \textbf{Capability Type Annotations}: \texttt{[Cap C]} annotations on session types
track which capabilities are required for each protocol step, composing
alongside the protocol itself.

\item \textbf{Protocol Composition via Named Sessions}: Named session types compose
through type-level continuations --- exactly the mechanism used throughout
this document to build complex protocols from simple building blocks.
\end{itemize}
\subsection{17.2 What Prologos Is Building Toward}
\label{sec:org46a977d}

Several capabilities are in active development or planned:

\begin{itemize}
\item \textbf{Session-Derived Effect Ordering (Architecture A+D)}: The effect position
lattice (recently completed) enables IO effects to be ordered by session
type structure via a Galois connection. This means the ordering of
capability operations in an Endo-like system would be derived from the
session types --- not from ad-hoc code ordering --- and verified by the
type checker.

\item \textbf{Async Session Semantics}: The \texttt{!!/??} operators currently exist in the
type system but their runtime semantics (buffered channels, promise
pipelining) are not yet fully implemented. Full async session support
would enable direct execution of the protocols modelled in this document.

\item \textbf{Process Calculus Runtime}: Prologos's \texttt{proc} runtime supports
multi-channel processes, but does not yet have network-transparent
capability passing. Adding CapTP-like capability transport at the runtime
level would enable Prologos processes to interact with Endo-style systems.

\item \textbf{Static Deadlock Detection}: The transitive closure computation in the
effect position lattice can detect cycles in cross-channel data
dependencies, turning runtime deadlocks into compile-time errors. Applied
to an Endo-like formula graph, this would detect circular liveness
dependencies in the cancellation context.

\item \textbf{Refinement Types for Protocol Properties}: With dependent types, Prologos
can express refinement predicates over session states --- e.g., "this
message number refers to an existing message" or "this slot ID refers to
an exported object." These go beyond standard session types into
property-rich protocol specifications.
\end{itemize}
\subsection{17.3 The Unique Value Proposition}
\label{sec:org7ff045a}

What makes Prologos uniquely suited to modelling systems like Endo is the
\emph{convergence} of multiple type system features:

\begin{enumerate}
\item \textbf{Session types} capture the communication protocol structure.
\item \textbf{Linear types} capture the resource discipline (capability transfer,
mutex acquire/release, one-shot tokens).
\item \textbf{Dependent types} capture data-dependent protocol branching (indexed
sessions, message-number-scoped responses).
\item \textbf{Capability annotations} track authority through protocol transitions.
\item \textbf{Propagator networks} provide the compositional, monotone reasoning
substrate for effect ordering and constraint solving.
\end{enumerate}

No other system currently combines all five. Existing tools offer subsets:

\begin{itemize}
\item \textbf{Scribble/mpst}: Session types, but no dependent types, linear types, or
capability tracking.
\item \textbf{Linear Haskell}: Linear types, but session types require encoding tricks
and dependent types are limited.
\item \textbf{Idris 2}: Dependent types with QTT multiplicities, but session types
require encoding as indexed monads.
\item \textbf{Rust}: Ownership/borrowing (affine types), but no session types or
dependent types in the type system.
\end{itemize}

Prologos aims to be the first language where all five features are native
and compose naturally through the type system.
