docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.tex
\subsection{17.4 Toward an Endo Verification Story}
\label{sec:org134e18e}

A fully realized Prologos could provide Endo with:

\begin{itemize}
\item \textbf{Protocol specification language}: Define each CapTP message flow, formula
lifecycle, and agent interaction as a session type. The specification
serves as both documentation and executable verification.

\item \textbf{Exhaustive dispatch verification}: Session type choices (\texttt{\&>}) ensure
that every formula type, message type, and protocol branch is handled.
Missing a case is a compile-time error.

\item \textbf{Linear resource safety}: Capabilities that must be used exactly once
(invitations, pins, mutex tokens) are tracked by the type system.
Dropping a linear capability is a type error. Using it twice is a type
error.

\item \textbf{Ordering constraint verification}: The session-derived effect ordering
ensures that operations like "write edge before status" are verified by
the type checker, not by code review.

\item \textbf{Cross-agent protocol compatibility}: When Agent A sends a message to
Agent B, their session types must be \emph{dual}. The type checker verifies
this, catching protocol mismatches before runtime.

\item \textbf{Composition verification}: When protocols are composed (\texttt{Daemon-Bootstrap}
chains \texttt{Formula-Lifecycle}, \texttt{CapTP-Bootstrap}, \texttt{Host-Protocol}), the
composed session type is well-formed if and only if all the named
sub-sessions are compatible at their boundaries.
\end{itemize}
\section{18. Theoretical Connections}
\label{sec:orge0bd02c}

\subsection{18.1 OCap and Session Types}
\label{sec:org25af20f}

Object-capability security and session types share a deep connection through
linear logic. Both enforce:

\begin{itemize}
\item \textbf{Authority is held, not named}: In OCap, holding a reference is having
the capability. In session types, holding a channel endpoint is having
the communication capability.
\item \textbf{Transfer is explicit}: In OCap, capabilities are granted by passing
references. In session types, channel delegation (\texttt{!} / \texttt{?} of a channel)
explicitly transfers communication authority.
\item \textbf{Attenuation via typing}: In OCap, a restricted facet attenuates
authority. In session types, a subtype (offering fewer choices) attenuates
the protocol.
\end{itemize}

Caires and Pfenning's foundational work connecting session types to linear
logic propositions (Curry-Howard for sessions) provides the theoretical
bridge: a session type \emph{is} a linear logic proposition, and linear logic
is the logic of resources --- the same resource discipline that underlies
OCap.
\subsection{18.2 Promise Pipelining and Async Sessions}
\label{sec:org16146cb}

Endo's promise pipelining (\texttt{E(E(x).foo()).bar()} sends both calls
immediately) is precisely the operational semantics of async session types.
In a session with \texttt{!! A . !! B}, both sends can be issued without waiting
for acknowledgment. The session type guarantees that they will be received
in order on the dual side, but the sender does not block.

This connection is not accidental. Mark Miller's E language --- the direct
ancestor of Endo's \texttt{E()} eventual-send proxy --- was designed with
exactly this pipelining semantics. Async session types formalize what E
provided operationally.
\subsection{18.3 Formula Graph as Process Calculus}
\label{sec:orgf1e2fb9}

The Endo formula graph can be viewed as a \emph{process calculus} configuration:
each formula is a process, each edge is a channel, and formula lifecycle
operations (create, evaluate, cancel) are process creation, execution, and
termination. The formula graph's GC is process-level garbage collection ---
collecting processes that are no longer reachable through any channel.

This process calculus view is exactly what Prologos's \texttt{proc} runtime
provides. The connection suggests a natural embedding: Endo formulas as
Prologos processes, formula identifiers as channel names, and CapTP messages
as session-typed communications.
\section{19. CRDT-Based Retention for Distributed Formula References}
\label{sec:org5526901}

A hypothesis contributed by an Endo maintainer: \emph{the formula system is
missing a CRDT for managing retention of local formulas on a pair of
connected peers that must be able to progress when partitioned, notably for
deletion of references, as this is the basis for revocation.}

This section analyzes this hypothesis through the lens of our session type
models and finds it well-founded.
\subsection{19.1 The Partition Problem}
\label{sec:org54ee6d6}

The formula graph currently assumes a centralized, connected model.
Reference counting between peers flows through \texttt{CTP\_DROP} messages, and GC
is a local sweep that runs under the single async mutex. When two peers are
connected, this works:

\begin{verbatim}
Peer A                    Peer B
──────                    ──────
Host holds handle →       Guest has o-N import
Host cancels formula →    Sends CTP_DROP → Guest releases
GC sweep →                Reference count = 0 → Collect
\end{verbatim}

Under partition, this breaks:

\begin{verbatim}
Peer A                    ║  Peer B
──────                    ║  ──────
Host cancels formula      ║  Guest still holds o-N import
Wants to send CTP_DROP    ║  Network down — message never arrives
GC sweep sees no remote   ║  Guest may pass capability to Carol
  refs (can't reach B)    ║    via promise pipelining
                          ║
Dilemma:                  ║
- GC eagerly?             ║  → Dangling reference when B reconnects
- Retain conservatively?  ║  → Leaked references, no revocation
\end{verbatim}
\subsection{19.2 Why Reference Counting Fails Under Partition}
\label{sec:orgabee685}

The current \texttt{CTP\_DROP} protocol is a \emph{coordination-dependent} reference
counting scheme. It has three properties that are individually reasonable
but collectively problematic for partitioned operation:

\begin{enumerate}
\item \textbf{Reference counts are split across peers}: The exporting side tracks
how many times a slot has been imported, but this count is maintained
through \texttt{CTP\_DROP} messages that decrement it. If messages can't flow,
the count diverges from reality.

\item \textbf{GC assumes reachability information is current}: The 10-step GC sweep
counts references from local pet stores, local formula dependencies, and
\emph{known} remote imports. But during partition, the "known remote imports"
set is stale --- the remote peer may have already dropped references, or
may have created new ones via capability delegation.

\item \textbf{Revocation is a cancel + GC cycle}: When a host cancels a formula, the
\texttt{withCollection} wrapper triggers GC, which should collect the cancelled
formula and send \texttt{CTP\_DROP} to all importers. But under partition, the
drops don't arrive, and the remote peer continues holding a reference to
a cancelled formula. On reconnection, the peer discovers the formula no
longer exists --- a dangling reference.
\end{enumerate}
