docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
** 19.3 CRDT Design for Retention State

A CRDT (Conflict-Free Replicated Data Type) for retention state would allow
each peer to make progress independently during partition, with convergent
merge on reconnection. The natural choice is an operation-based CRDT where:

- *Retain* and *Revoke* are the two operations
- *Revoke wins* on conflict (authority-first semantics, aligned with OCap)
- Each formula's retention state includes a /vector clock/ or /Lamport
  timestamp/ so that causal ordering is preserved

#+begin_src prologos
;; --- Retention CRDT ---
;; A per-formula, per-peer retention state.

type RetentionOp
  := Retain Timestamp                    ;; "I am holding this reference"
   | Revoke Timestamp                    ;; "I revoke this capability"

type RetentionState
  :formula-id FormulaIdentifier
  :local-ops  [List RetentionOp]         ;; operations from this peer
  :remote-ops [List RetentionOp]         ;; operations from the other peer
  :merged     RetentionDecision          ;; resolved state

type RetentionDecision
  := Alive                               ;; at least one active Retain, no Revoke
   | Revoked Timestamp                   ;; authoritative revocation (wins)
   | Expired Timestamp                   ;; all Retains withdrawn, no Revoke needed

;; The merge function: join-semilattice (monotone, commutative, idempotent)
;; Revoke always wins over Retain. Later timestamps supersede earlier ones.
;; This IS a lattice: bot = no operations, top = Revoked.
#+end_src

The merge semantics are:

| Local State | Remote State | Merged Result | Rationale                              |
|-------------+--------------+---------------+----------------------------------------|
| Retain(t1)  | Retain(t2)   | Alive         | Both peers agree: reference is live     |
| Retain(t1)  | Revoke(t2)   | Revoked(t2)   | Revocation wins (authority-first)       |
| Revoke(t1)  | Retain(t2)   | Revoked(t1)   | Revocation wins regardless of ordering  |
| Revoke(t1)  | Revoke(t2)   | Revoked(max)  | Both agree, use latest timestamp        |
| Retain(t1)  | (none)       | Alive         | Remote hasn't reported; assume live     |
| Revoke(t1)  | (none)       | Revoked(t1)   | Local revocation is immediately binding |

** 19.4 Session Type for CRDT-Aware Retention

#+begin_src prologos
;; --- CRDT Retention Protocol ---
;; Replaces CTP_DROP with a convergent retention protocol.

session Retention-Protocol
  ;; Phase 1: Initial capability grant
  !! Handle                                ;; export the capability
  !! RetentionEpoch                        ;; initial epoch (monotonic)
  Retention-Active

session Retention-Active
  rec Active
    &>
      ;; Normal capability usage — calls tagged with epoch
      | :use ->
          ?? [CapTP-Call Epoch]             ;; call tagged with peer's epoch
          +>
            | :epoch-current ->
                !! CapTP-Result
                Active
            | :epoch-stale ->
                !! EpochExpired            ;; clean error, not dangling ref
                Active
      ;; Local revocation (works during partition)
      | :revoke ->
          ! RevocationRecord               ;; persist CRDT op locally
          ;; Does NOT send CTP_DROP — revocation is a CRDT op
          Active                           ;; stay active; merge on reconnect
      ;; Reconnection: merge CRDT states
      | :reconnect ->
          ?? PeerRetentionState            ;; receive peer's retention ops
          ! MergedRetentionState           ;; send merge result
          ;; Apply merged revocations
          Retention-Active-Post-Merge
      ;; Clean disconnection
      | :disconnect ->
          end

session Retention-Active-Post-Merge
  rec PostMerge
    +>
      | :apply-revocation ->
          ! FormulaIdentifier              ;; revoke this formula
          ! CancelSignal                   ;; cancel its dependents
          PostMerge
      | :merge-complete ->
          Retention-Active                 ;; back to normal operation
#+end_src

** 19.5 Impact on GC

With CRDT retention, the GC algorithm gains a new input: the local
retention state. The current "count references from known remote imports"
step would be replaced by "consult the retention CRDT for each formula's
aliveness across all peers":

#+begin_src prologos
;; --- CRDT-Aware GC ---
;; Step 4 of GC-Sweep changes: root set includes CRDT-alive formulas.

session GC-Sweep-CRDT
  ;; Steps 1-3 unchanged (assign groups, build deps, count refs)
  ! GroupAssignment
  ! [Map GroupId [Set GroupId]]
  ! [Map GroupId Nat]

  ;; Step 4 (modified): Root set includes CRDT-alive formulas
  ! [Set GroupId]                          ;; permanent roots (unchanged)
  ! [Set GroupId]                          ;; CRDT-alive: Retain without Revoke
  ! [Set GroupId]                          ;; transitively reachable from both

  ;; Steps 5-10 unchanged
  ! [Set GroupId]                          ;; groups to collect
  !! CancelBatch
  !! DropBatch
  !! DisconnectBatch
  ! DeleteBatch
  ! GCComplete
  end
#+end_src

** 19.6 Why This Matters for Revocation

In OCap security, revocation must be /authoritative/. When Alice grants Bob
a capability and later wants to revoke it, the revocation must take effect
regardless of Bob's state. With the current protocol, revocation requires
Bob to be connected (to receive =CTP_DROP=). With a revoke-wins CRDT:

- Alice revokes locally, immediately. Her daemon marks the formula as
  revoked in the CRDT.
- Bob may continue using the capability during partition (his local CRDT
  still says "Alive").
- On reconnection, CRDT merge happens. Revoke wins. Bob discovers the
  formula is revoked. His calls get clean "EpochExpired" errors, not
  dangling references.
- Crucially: Bob cannot "un-revoke" by sending a Retain after the Revoke.
  The lattice is monotone --- once revoked, always revoked.

This aligns with the capability discipline: the authority that grants a
capability should be the authority that revokes it, without requiring
consensus from the holder.


* 20. Practical Recommendations for the Endo Codebase

This section offers concrete, graduated recommendations for the Endo team
--- organized from lowest to highest implementation effort, all achievable
within the existing JavaScript codebase without requiring Prologos or any
external type system.

** 20.1 Immediate / Low Effort

