docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
*** 20.1.1 Explicit State Machine for Formula Lifecycle

The formula lifecycle (§5.1) is currently implicit across =daemon.js=,
=graph.js=, and =context.js=. Different code paths implement different
lifecycle transitions with no single authoritative representation.

*Recommendation*: Extract a =FormulaState= enum and a =transitionState=
function that validates transitions:

#+begin_example javascript
// formula-state.js
const FormulaState = /** @enum {string} */ ({
  PREFORMULATE: 'preformulate',   // ID assigned, not yet persisted
  PERSISTED: 'persisted',         // on disk, not yet in graph
  REGISTERED: 'registered',       // in graph, controller not yet created
  CONTROLLED: 'controlled',       // controller exists (synchronous)
  EVALUATING: 'evaluating',       // async evaluation in progress
  ACTIVE: 'active',               // value available
  CANCELLING: 'cancelling',       // cancel initiated, cascading
  CANCELLED: 'cancelled',         // fully cancelled
  DISPOSED: 'disposed',           // cleanup hooks run, removed from graph
});

const validTransitions = new Map([
  [FormulaState.PREFORMULATE, [FormulaState.PERSISTED]],
  [FormulaState.PERSISTED, [FormulaState.REGISTERED]],
  [FormulaState.REGISTERED, [FormulaState.CONTROLLED]],
  [FormulaState.CONTROLLED, [FormulaState.EVALUATING, FormulaState.CANCELLING]],
  [FormulaState.EVALUATING, [FormulaState.ACTIVE, FormulaState.CANCELLING]],
  [FormulaState.ACTIVE, [FormulaState.CANCELLING]],
  [FormulaState.CANCELLING, [FormulaState.CANCELLED]],
  [FormulaState.CANCELLED, [FormulaState.DISPOSED]],
]);

const transitionState = (current, next) => {
  const allowed = validTransitions.get(current);
  if (!allowed || !allowed.includes(next)) {
    throw Error(`Invalid formula transition: ${current} → ${next}`);
  }
  return next;
};
#+end_example

*Effort*: Small. The transitions already happen; this just makes them
explicit and validates them. Every =Fail("unexpected formula state")= in the
codebase becomes a caught invalid transition instead of a mystery crash.

*Value*: This is the JavaScript equivalent of the =Formula-Lifecycle=
session type from §5. It turns implicit protocol assumptions into runtime
assertions. When a new formula type is added, the valid transitions are
declared alongside the type.

*** 20.1.2 Exhaustive Formula Type Dispatch

Several dispatch sites in =daemon.js= switch on =formula.type= but do not
assert exhaustiveness. TypeScript's =satisfies= or a runtime assertion can
catch missing cases:

#+begin_example javascript
// At each dispatch site:
const formulaHandlers = /** @type {Record<FormulaType, Function>} */ ({
  endo: makeEndoFormula,
  host: makeHostFormula,
  guest: makeGuestFormula,
  // ... all 26+ types
});

const handler = formulaHandlers[formula.type];
if (!handler) {
  throw Error(`Unhandled formula type: ${formula.type}`);
}
#+end_example

*Effort*: Minimal per dispatch site. An afternoon of auditing to find all
switch sites and add the handler map.

*Value*: This is the JavaScript equivalent of the exhaustive =&>= session
type choice from §15.5. Adding a new formula type without updating /all/
dispatch sites becomes an immediate, obvious error.

*** 20.1.3 Pin Lifecycle Tracking

Add a =WeakRef= + =FinalizationRegistry= based tracker for transient pins
to detect leaks:

#+begin_example javascript
const activePins = new Map();  // formulaId → { pinTime, stackTrace }

const pinTransientTracked = (formulaId) => {
  activePins.set(formulaId, {
    pinnedAt: Date.now(),
    stack: new Error('pin origin').stack,
  });
  pinTransient(formulaId);
};

const unpinTransientTracked = (formulaId) => {
  activePins.delete(formulaId);
  unpinTransient(formulaId);
};

// Periodic leak detection (e.g., every 60s)
setInterval(() => {
  const now = Date.now();
  for (const [id, info] of activePins) {
    if (now - info.pinnedAt > 30_000) {
      console.warn(`Pin leak detected: ${id}, pinned ${now - info.pinnedAt}ms ago`);
      console.warn(info.stack);
    }
  }
}, 60_000);
#+end_example

*Effort*: Small. Wraps existing pin/unpin calls with tracking.

*Value*: Detects the pin leak scenario described in §5.4 and §15.2 at
runtime. Not a static guarantee, but a practical diagnostic that catches
the exact failure mode.

** 20.2 Medium Effort

*** 20.2.1 Operation Ordering Assertions

The GC protocol has critical ordering constraints (§10.3, §15.3, §15.4):
pet store edge before resolution status, =CTP_DROP= before
=CTP_DISCONNECT=. These can be asserted with ordered checkpoints:

#+begin_example javascript
// ordering.js — lightweight ordered-checkpoint assertions
const makeOrderedCheckpoints = (name) => {
  const reached = [];
  return harden({
    checkpoint(label) {
      reached.push(label);
    },
    assertOrder(...expectedOrder) {
      for (let i = 0; i < expectedOrder.length - 1; i++) {
        const a = reached.indexOf(expectedOrder[i]);
        const b = reached.indexOf(expectedOrder[i + 1]);
        if (a === -1 || b === -1 || a >= b) {
          throw Error(
            `${name}: ordering violation: ` +
            `expected ${expectedOrder[i]} before ${expectedOrder[i + 1]}`
          );
        }
      }
    },
  });
};

// Usage in promise resolution:
const cp = makeOrderedCheckpoints('promise-resolution');
// ... write pet store edge ...
cp.checkpoint('edge-written');
// ... write resolution status ...
cp.checkpoint('status-written');
cp.assertOrder('edge-written', 'status-written');
#+end_example

*Effort*: Medium. Requires identifying all ordering-critical code paths
and inserting checkpoints. The =makeOrderedCheckpoints= utility is trivial;
the audit to find all critical orderings is the real work.

*Value*: This is the JavaScript equivalent of the ordered session type
=Promise-Resolution-Safe= from §15.3. It turns implicit code-ordering
dependencies into explicit, runtime-checked invariants.

*** 20.2.2 RemoteControl State Machine Hardening

The =RemoteControl= type already has an implicit state machine
(Pending → Connected → Disconnected). The test suite covers ID-based
connection arbitration. But there are no partition-specific tests, and
the state machine doesn't model "partitioned" as a distinct state.

*Recommendation*: Add a =PARTITIONED= state and a heartbeat/timeout
mechanism:

#+begin_example javascript
const RemoteControlState = {
  PENDING: 'pending',
  CONNECTED: 'connected',
  PARTITIONED: 'partitioned',   // NEW: connection silent for > timeout
  DISCONNECTED: 'disconnected',
};
#+end_example

When a connection has received no messages for a configurable timeout,
transition from =CONNECTED= to =PARTITIONED=. In the =PARTITIONED= state:
- Outbound calls are queued (not dropped)
- The retention state for shared formulas is frozen (no GC of remotely-held formulas)
- A reconnection attempt is scheduled

On reconnection, transition from =PARTITIONED= back to =CONNECTED= and
flush the queued calls.

*Effort*: Medium. The heartbeat mechanism needs to be added to the CapTP
layer. The state machine change is straightforward given the existing
=RemoteControl= structure.

*Value*: This is the architectural prerequisite for CRDT-based retention.
Without a =PARTITIONED= state, the system can't distinguish "peer is slow"
from "peer is unreachable," and can't defer GC decisions accordingly.

