docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.tex

\subsubsection{20.1.1 Explicit State Machine for Formula Lifecycle}
\label{sec:org0b3707a}

The formula lifecycle (§5.1) is currently implicit across \texttt{daemon.js},
\texttt{graph.js}, and \texttt{context.js}. Different code paths implement different
lifecycle transitions with no single authoritative representation.

\textbf{Recommendation}: Extract a \texttt{FormulaState} enum and a \texttt{transitionState}
function that validates transitions:

\begin{verbatim}
// formula-state.js
const FormulaState = /** @enum {string} */ ({
  PREFORMULATE: 'preformulate',   // ID assigned, not yet persisted
  PERSISTED: 'persisted',         // on disk, not yet in graph
  REGISTERED: 'registered',       // in graph, controller not yet created
  CONTROLLED: 'controlled',       // controller exists (synchronous)
  EVALUATING: 'evaluating',       // async evaluation in progress
  ACTIVE: 'active',               // value available
  CANCELLING: 'cancelling',       // cancel initiated, cascading
  CANCELLED: 'cancelled',         // fully cancelled
  DISPOSED: 'disposed',           // cleanup hooks run, removed from graph
});

const validTransitions = new Map([
  [FormulaState.PREFORMULATE, [FormulaState.PERSISTED]],
  [FormulaState.PERSISTED, [FormulaState.REGISTERED]],
  [FormulaState.REGISTERED, [FormulaState.CONTROLLED]],
  [FormulaState.CONTROLLED, [FormulaState.EVALUATING, FormulaState.CANCELLING]],
  [FormulaState.EVALUATING, [FormulaState.ACTIVE, FormulaState.CANCELLING]],
  [FormulaState.ACTIVE, [FormulaState.CANCELLING]],
  [FormulaState.CANCELLING, [FormulaState.CANCELLED]],
  [FormulaState.CANCELLED, [FormulaState.DISPOSED]],
]);

const transitionState = (current, next) => {
  const allowed = validTransitions.get(current);
  if (!allowed || !allowed.includes(next)) {
    throw Error(`Invalid formula transition: ${current} → ${next}`);
  }
  return next;
};
\end{verbatim}

\textbf{Effort}: Small. The transitions already happen; this just makes them
explicit and validates them. Every \texttt{Fail("unexpected formula state")} in the
codebase becomes a caught invalid transition instead of a mystery crash.

\textbf{Value}: This is the JavaScript equivalent of the \texttt{Formula-Lifecycle}
session type from §5. It turns implicit protocol assumptions into runtime
assertions. When a new formula type is added, the valid transitions are
declared alongside the type.
\subsubsection{20.1.2 Exhaustive Formula Type Dispatch}
\label{sec:org358c2c9}

Several dispatch sites in \texttt{daemon.js} switch on \texttt{formula.type} but do not
assert exhaustiveness. TypeScript's \texttt{satisfies} or a runtime assertion can
catch missing cases:

\begin{verbatim}
// At each dispatch site:
const formulaHandlers = /** @type {Record<FormulaType, Function>} */ ({
  endo: makeEndoFormula,
  host: makeHostFormula,
  guest: makeGuestFormula,
  // ... all 26+ types
});

const handler = formulaHandlers[formula.type];
if (!handler) {
  throw Error(`Unhandled formula type: ${formula.type}`);
}
\end{verbatim}

\textbf{Effort}: Minimal per dispatch site. An afternoon of auditing to find all
switch sites and add the handler map.

\textbf{Value}: This is the JavaScript equivalent of the exhaustive \texttt{\&>} session
type choice from §15.5. Adding a new formula type without updating \emph{all}
dispatch sites becomes an immediate, obvious error.
\subsubsection{20.1.3 Pin Lifecycle Tracking}
\label{sec:org1205fd5}

Add a \texttt{WeakRef} + \texttt{FinalizationRegistry} based tracker for transient pins
to detect leaks:

\begin{verbatim}
const activePins = new Map();  // formulaId → { pinTime, stackTrace }

const pinTransientTracked = (formulaId) => {
  activePins.set(formulaId, {
    pinnedAt: Date.now(),
    stack: new Error('pin origin').stack,
  });
  pinTransient(formulaId);
};

const unpinTransientTracked = (formulaId) => {
  activePins.delete(formulaId);
  unpinTransient(formulaId);
};

// Periodic leak detection (e.g., every 60s)
setInterval(() => {
  const now = Date.now();
  for (const [id, info] of activePins) {
    if (now - info.pinnedAt > 30_000) {
      console.warn(`Pin leak detected: ${id}, pinned ${now - info.pinnedAt}ms ago`);
      console.warn(info.stack);
    }
  }
}, 60_000);
\end{verbatim}

\textbf{Effort}: Small. Wraps existing pin/unpin calls with tracking.

\textbf{Value}: Detects the pin leak scenario described in §5.4 and §15.2 at
runtime. Not a static guarantee, but a practical diagnostic that catches
the exact failure mode.
\subsection{20.2 Medium Effort}
\label{sec:org97014b1}

\subsubsection{20.2.1 Operation Ordering Assertions}
\label{sec:orga1b9021}

The GC protocol has critical ordering constraints (§10.3, §15.3, §15.4):
pet store edge before resolution status, \texttt{CTP\_DROP} before
\texttt{CTP\_DISCONNECT}. These can be asserted with ordered checkpoints:

\begin{verbatim}
// ordering.js — lightweight ordered-checkpoint assertions
const makeOrderedCheckpoints = (name) => {
  const reached = [];
  return harden({
    checkpoint(label) {
      reached.push(label);
    },
    assertOrder(...expectedOrder) {
      for (let i = 0; i < expectedOrder.length - 1; i++) {
        const a = reached.indexOf(expectedOrder[i]);
        const b = reached.indexOf(expectedOrder[i + 1]);
        if (a === -1 || b === -1 || a >= b) {
          throw Error(
            `${name}: ordering violation: ` +
            `expected ${expectedOrder[i]} before ${expectedOrder[i + 1]}`
          );
        }
      }
    },
  });
};

// Usage in promise resolution:
const cp = makeOrderedCheckpoints('promise-resolution');
// ... write pet store edge ...
cp.checkpoint('edge-written');
// ... write resolution status ...
cp.checkpoint('status-written');
cp.assertOrder('edge-written', 'status-written');
\end{verbatim}

\textbf{Effort}: Medium. Requires identifying all ordering-critical code paths
and inserting checkpoints. The \texttt{makeOrderedCheckpoints} utility is trivial;
the audit to find all critical orderings is the real work.

\textbf{Value}: This is the JavaScript equivalent of the ordered session type
\texttt{Promise-Resolution-Safe} from §15.3. It turns implicit code-ordering
dependencies into explicit, runtime-checked invariants.
\subsubsection{20.2.2 RemoteControl State Machine Hardening}
\label{sec:orgaecb0c3}

The \texttt{RemoteControl} type already has an implicit state machine
(Pending → Connected → Disconnected). The test suite covers ID-based
connection arbitration. But there are no partition-specific tests, and
the state machine doesn't model "partitioned" as a distinct state.

\textbf{Recommendation}: Add a \texttt{PARTITIONED} state and a heartbeat/timeout
mechanism:

\begin{verbatim}
const RemoteControlState = {
  PENDING: 'pending',
  CONNECTED: 'connected',
  PARTITIONED: 'partitioned',   // NEW: connection silent for > timeout
  DISCONNECTED: 'disconnected',
};
\end{verbatim}

When a connection has received no messages for a configurable timeout,
transition from \texttt{CONNECTED} to \texttt{PARTITIONED}. In the \texttt{PARTITIONED} state:
\begin{itemize}
\item Outbound calls are queued (not dropped)
\item The retention state for shared formulas is frozen (no GC of remotely-held formulas)
\item A reconnection attempt is scheduled
\end{itemize}

On reconnection, transition from \texttt{PARTITIONED} back to \texttt{CONNECTED} and
flush the queued calls.

\textbf{Effort}: Medium. The heartbeat mechanism needs to be added to the CapTP
layer. The state machine change is straightforward given the existing
\texttt{RemoteControl} structure.

\textbf{Value}: This is the architectural prerequisite for CRDT-based retention.
Without a \texttt{PARTITIONED} state, the system can't distinguish "peer is slow"
from "peer is unreachable," and can't defer GC decisions accordingly.
