docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.tex
\subsubsection{20.2.3 Structured Protocol Logging}
\label{sec:org653c5c4}

Add structured logging at protocol boundaries that captures the session
type operations (send/recv/select/offer) as named events:

\begin{verbatim}
// protocol-log.js
const protocolLog = (sessionName, step, data) => {
  console.log(JSON.stringify({
    session: sessionName,
    step: step,      // 'send', 'recv', 'select', 'offer'
    timestamp: Date.now(),
    data: typeof data === 'object' ? Object.keys(data) : typeof data,
  }));
};

// Usage:
protocolLog('CapTP-Bootstrap', 'send', { type: 'CTP_BOOTSTRAP' });
protocolLog('Formula-Lifecycle', 'transition', { from: 'CONTROLLED', to: 'EVALUATING' });
\end{verbatim}

\textbf{Effort}: Medium (pervasive but mechanical).

\textbf{Value}: Creates an observable trace that can be compared against the
session type specifications in this document. Deviations between the
expected session type protocol and the actual log trace indicate protocol
bugs.
\subsection{20.3 Larger Architectural Shifts}
\label{sec:org6624b59}

\subsubsection{20.3.1 CRDT Retention Layer}
\label{sec:org6666850}

Implement the CRDT-based retention protocol described in §19. This is the
most impactful recommendation but also the largest effort.

\textbf{Implementation sketch}:

\begin{enumerate}
\item Define a \texttt{RetentionCRDT} module with:
\begin{itemize}
\item Per-formula, per-peer retention state
\item \texttt{retain(formulaId, timestamp)} and \texttt{revoke(formulaId, timestamp)} operations
\item \texttt{merge(localState, remoteState) → mergedState} using revoke-wins semantics
\item Persistence to disk alongside formula JSON
\end{itemize}

\item Replace \texttt{CTP\_DROP} reference counting with CRDT operations:
\begin{itemize}
\item When a peer imports a formula: \texttt{retain(formulaId, now)}
\item When a peer drops a reference: \texttt{revoke(formulaId, now)} (instead of \texttt{CTP\_DROP})
\item On reconnection: exchange and merge retention states
\end{itemize}

\item Modify GC to consult the retention CRDT:
\begin{itemize}
\item A formula with any \texttt{Alive} retention state across any peer is a root
\item A formula with \texttt{Revoked} retention from the granting host is dead
regardless of remote retention
\end{itemize}
\end{enumerate}

\textbf{Effort}: Substantial (multi-week, across multiple subsystems). The CRDT
itself is simple (join-semilattice with revoke-wins). The integration with
GC, CapTP, and persistence is the real work.

\textbf{Value}: Solves the partition-revocation problem entirely. Enables the
following properties that the current system lacks:
\begin{itemize}
\item Revocation works during partition
\item GC does not create dangling references across peers
\item Reconnection is idempotent (merge is commutative and idempotent)
\item No coordination required between peers for revocation
\end{itemize}
\subsubsection{20.3.2 TypeScript Branded Types for FormulaIdentifier}
\label{sec:org5259646}

The \texttt{types.d.ts} already uses branded string types (\texttt{FormulaNumber},
\texttt{NodeNumber}, \texttt{FormulaIdentifier}). Extend this pattern to enforce formula
lifecycle states at the type level:

\begin{verbatim}
type UnpersistedFormulaId = string & { __brand: 'UnpersistedFormulaId' };
type PersistedFormulaId = string & { __brand: 'PersistedFormulaId' };
type ActiveFormulaId = string & { __brand: 'ActiveFormulaId' };

// Functions that require specific lifecycle states:
declare function persistFormula(id: UnpersistedFormulaId): PersistedFormulaId;
declare function evaluateFormula(id: PersistedFormulaId): ActiveFormulaId;
declare function cancelFormula(id: ActiveFormulaId): void;

// Type error: can't cancel an unpersisted formula
cancelFormula(makeFormulaId()); // Error!
\end{verbatim}

\textbf{Effort}: Medium (requires converting JSDoc types to proper TypeScript or
extending the existing branded type pattern).

\textbf{Value}: A limited form of session typing — the branded types track which
lifecycle state a formula ID is in, and functions that require specific
states reject IDs in the wrong state. Not as powerful as real session types,
but catches a class of bugs where a formula ID is used before its formula
has been properly initialized.
\subsubsection{20.3.3 Protocol Conformance Testing}
\label{sec:orgca74a31}

Write integration tests that verify protocol conformance against the
session type specifications in this document. For each named session type,
write a test that:

\begin{enumerate}
\item Exercises the happy path (all protocol steps in order)
\item Exercises error branches (what happens when the protocol is violated)
\item Exercises edge cases (timeout, partition, crash-recovery)
\end{enumerate}

The existing test suite has \texttt{remote-control.test.js} with state machine
coverage, but no tests for partition scenarios, GC ordering, or
cross-agent protocol conformance.

\textbf{Effort}: Medium-to-large (depends on how many protocols are tested).

\textbf{Value}: Even without static session typing, conformance tests verify that
the implementation matches the protocol specification. When the protocol
specification (this document) and the test suite agree, there is high
confidence in the implementation's correctness.
\section{21. Conclusion}
\label{sec:orgf81b30b}

The Endo system, with its formula graph, CapTP protocol, agent hierarchy,
and distributed garbage collection, is a rich target for session type
analysis. Every major component maps naturally to a session type:

\begin{itemize}
\item The \emph{formula lifecycle} is a linear state machine with ordering
constraints that session types make explicit.
\item \emph{CapTP} is a multiplexed, asynchronous protocol that maps directly to
indexed async session types with duality.
\item \emph{Agent protocols} (host, guest, worker) are choice-based session types
with subtyping for capability attenuation.
\item \emph{Pet store} and \emph{mailbox} are stateful protocols with pub/sub extensions
that compose with the main agent protocols.
\item \emph{Garbage collection} is an ordering-critical protocol where session types
prevent the subtle bugs that arise from misordered steps.
\item \emph{Retention under partition} is a convergent state problem that CRDTs solve,
with revoke-wins semantics preserving OCap revocation authority.
\end{itemize}

The analysis identifies concrete protocol properties --- mutex re-entrancy
prevention, pin leak detection, GC ordering safety, dispatch exhaustiveness,
message number validity, and partition-safe revocation --- that session types
and related type-theoretic tools can verify statically. These properties are
currently enforced by runtime checks, code ordering, and developer
discipline. The practical recommendations in §20 show how to incrementally
harden the existing codebase, from low-effort state machine extraction and
exhaustive dispatch maps to medium-effort protocol ordering assertions and
partition-aware state machines, culminating in a CRDT retention layer that
would solve the distributed revocation problem.

Prologos's unique combination of session types, linear types, dependent
types, capability annotations, and propagator-based effect ordering makes
it the natural tool for this kind of protocol verification. As the language
matures, it aims to provide not just a modelling language for systems like
Endo, but a verification substrate where protocol correctness is a theorem,
not a hope.
