docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.org
* References

- Agoric. "Endo: Hardened JavaScript Runtime." https://github.com/endojs/endo.
  Commit =57f5ff1629e136a53fabdf0e27051b9641cd24c2=.

- Agoric. "Formula Graph Design." =packages/daemon/FORMULA-GRAPH.md= in Endo
  repository.

- Caires, L. and Pfenning, F. "Session Types as Intuitionistic Linear
  Propositions." CONCUR 2010.

- Miller, M. "Robust Composition: Towards a Unified Approach to Access
  Control and Concurrency Control." PhD Thesis, Johns Hopkins, 2006.

- Miller, M., Van Cutsem, T., and Tulloh, B. "Distributed Electronic
  Rights in JavaScript." ESOP 2013.

- Honda, K., Yoshida, N., and Carbone, M. "Multiparty Asynchronous Session
  Types." POPL 2008.

- Wadler, P. "Propositions as Sessions." ICFP 2012.

- Atkey, R. "Parameterised Notions of Computation." JFP 2009.

- Katsumata, S. "Parametric Effect Monads and Semantics of Effect Systems."
  POPL 2014.

- Prologos Project. "Protocols as Types: Composable Session Types in Prologos."
  =docs/tracking/principles/PROTOCOLS_AS_TYPES.org=. 2026.

- Prologos Project. "The AT Protocol as Composable Session Types."
  =docs/research/2026-03-05_ATP_AS_SESSION_TYPES.org=. 2026.

- Shapiro, M., Preguica, N., Baquero, C., and Zawirski, M. "Conflict-Free
  Replicated Data Types." SSS 2011.

- Bieniusa, A., et al. "An Optimized Conflict-Free Replicated Set."
  arXiv:1210.3368. 2012.

- Bocchi, L., Honda, K., and Tuosto, E. "Timed Multiparty Session Types."
  CONCUR 2014.

- Neykova, R., and Yoshida, N. "Session Types Go Dynamic, or How to Verify
  Your Python Conversations." FORTE 2017.
