docs/research/2026-03-07_ENDO_AS_SESSION_TYPES.tex
\section{References}
\label{sec:org7eea64a}

\begin{itemize}
\item Agoric. "Endo: Hardened JavaScript Runtime." \url{https://github.com/endojs/endo}.
Commit \texttt{57f5ff1629e136a53fabdf0e27051b9641cd24c2}.

\item Agoric. "Formula Graph Design." \texttt{packages/daemon/FORMULA-GRAPH.md} in Endo
repository.

\item Caires, L. and Pfenning, F. "Session Types as Intuitionistic Linear
Propositions." CONCUR 2010.

\item Miller, M. "Robust Composition: Towards a Unified Approach to Access
Control and Concurrency Control." PhD Thesis, Johns Hopkins, 2006.

\item Miller, M., Van Cutsem, T., and Tulloh, B. "Distributed Electronic
Rights in JavaScript." ESOP 2013.

\item Honda, K., Yoshida, N., and Carbone, M. "Multiparty Asynchronous Session
Types." POPL 2008.

\item Wadler, P. "Propositions as Sessions." ICFP 2012.

\item Atkey, R. "Parameterised Notions of Computation." JFP 2009.

\item Katsumata, S. "Parametric Effect Monads and Semantics of Effect Systems."
POPL 2014.

\item Prologos Project. "Protocols as Types: Composable Session Types in Prologos."
\texttt{docs/tracking/principles/PROTOCOLS\_AS\_TYPES.org}. 2026.

\item Prologos Project. "The AT Protocol as Composable Session Types."
\texttt{docs/research/2026-03-05\_ATP\_AS\_SESSION\_TYPES.org}. 2026.

\item Shapiro, M., Preguica, N., Baquero, C., and Zawirski, M. "Conflict-Free
Replicated Data Types." SSS 2011.

\item Bieniusa, A., et al. "An Optimized Conflict-Free Replicated Set."
arXiv:1210.3368. 2012.

\item Bocchi, L., Honda, K., and Tuosto, E. "Timed Multiparty Session Types."
CONCUR 2014.

\item Neykova, R., and Yoshida, N. "Session Types Go Dynamic, or How to Verify
Your Python Conversations." FORTE 2017.
\end{itemize}
\end{document}
